[{"heading":"Twitter CEO Jack Dorsey passionate about Bitcoin, expresses optimism towards Cryptocurrency","_id":"dfbad660-dc98-4307-a07f-db13e7e53c7e","_owner":"83f05366-1dab-4bd0-be63-69d21cd41e63","_createdDate":"2021-06-08T13:47:27.182Z","img":"https://i.ibb.co/4grknRs/Screenshot-2021-06-07-at-5-58-02-AM-auto-x2.png","_updatedDate":"2021-06-08T13:47:27.182Z","date":"Monday, 7 June 2021","category":"finance","news":"\"If I were not at Square or Twitter, I would be working on Bitcoin\", stated Jack Dorsey. He added, \"Bitcoin absolutely changes everything, I don't think there is anything more important in my lifetime to work on\".\n\nAccording to Dorsey, Bitcoin has the potential to create a new and enhanced, inclusive financial system, which will not only quicken international payments and protect against currency depreciation, but also be supportive for neglected communities all around the planet.","trending":"True"},{"heading":"Vaccines to cost India $11 billion due to Covid-19's second wave","_id":"47f94117-b7ed-4ce0-bdd4-061b1da11f3e","_owner":"83f05366-1dab-4bd0-be63-69d21cd41e63","_createdDate":"2021-06-08T13:46:41.900Z","img":"https://i.ibb.co/YBpNkh9/Screenshot-2021-06-08-at-7-25-42-PM.png","_updatedDate":"2021-06-08T13:56:26.570Z","date":"Monday, 7 June 2021","category":"economy","news":"India will need an additional $11 billion i.e Rs. 80,000 cr to provide free vaccines and food to its citizens that were impacted by the second wave of COVID-19.\nThe budget will be split as Rs. 70,000 for food before diwali and the remaining Rs. 10,000 towards free vaccines.","trending":"True"},{"heading":"Bitcoin to 7% US seizes $2.3 mn in crypto from hackers that were responsible for Colonial Pipeline","_id":"18227cfa-2bfe-4173-8400-a9a31bead27e","_owner":"83f05366-1dab-4bd0-be63-69d21cd41e63","_createdDate":"2021-06-08T11:15:25.158Z","img":"https://i.ibb.co/HhxGHjL/photo-1550565118-3a14e8d0386f.jpg","_updatedDate":"2021-06-08T11:31:48.908Z","date":"Tuesday, 8 June 2021","category":"finance","news":"Bitcoin falls to USD 33,100 this Tuesday after US law enforcement officials said they were able to recover USD 2.3 million in Bitcoin paid as ransom to a group of hackers who were responsible for crippling the Colonial Pipeline.\n\nAn analyst mentioned to Bloomberg that, since the investigators were able to trace and seize the cryptocurrency payment, it may have provoked the selling.","trending":"True"},{"heading":"March Madness: Six seeds the NCAA Tournament committee got wrong on Selection Sunday","_id":"b7a986a9-1aac-4ff4-a22c-1321c296ea3a","_owner":"83f05366-1dab-4bd0-be63-69d21cd41e63","_createdDate":"2021-05-31T13:10:44.962Z","img":"https://i.ibb.co/jrcLtkv/news2.jpg","_updatedDate":"2021-06-08T11:31:44.558Z","date":"Sunday, 6 June 2021","category":"sports","news":"This year, the NCAA Tournament selection committee was bound to have a difficult task in seeding teams. Following a scattered season of postponements, pauses, and cancellations due to COVID-19 protocols.\n\nThere's always strong debate about which teams make the field and which are left out, and this year's biggest surprise was the committee putting Wichita State into the field of 68. Fans always do their work, creating conflicts, and protesting for their favourite team.\n","trending":"True"},{"heading":"FBI Director Wray: 'Raw' gives warning prior to Capitol attack shared with police","_id":"12684baf-0239-4c57-a68c-0f277d4b5e7a","_owner":"83f05366-1dab-4bd0-be63-69d21cd41e63","_createdDate":"2021-05-31T13:10:03.165Z","img":"https://i.ibb.co/vd5J9t6/news3.png","_updatedDate":"2021-06-07T11:25:21.832Z","date":"Monday, 7 June 2021","category":"politics","news":"Tuesday, FBI Director Christopher Wray described a warning the night before the Capitol riots about the prospect of extreme violence as \"raw\",  \"unverified\" & \"wrong\" information, but he said the bureau's report was shared extensively with Capitol Police.\n\nWray said the report, which concluded that extremists were \"preparing for war,\" was provided to authorities at the command level, distributed to its local Joint Terrorism Task Force network.","trending":"True"},{"heading":"FedEx committing to reach carbon-neutral operations by 2040","_id":"d765faac-7beb-414f-8995-2bbd5e9ceeb3","_owner":"83f05366-1dab-4bd0-be63-69d21cd41e63","_createdDate":"2021-05-31T13:07:59.811Z","img":"https://i.ibb.co/pxcZMFH/news4.jpg","_updatedDate":"2021-06-08T20:06:07.752Z","date":"Monday, 7 June 2021","category":"finance","news":"MEMPHIS – FedEx is committing to reach carbon-neutral operations by 2040.\nFedEx is committing to reach carbon-neutral operations by 2040, aided in part by replacing its entire pickup and delivery fleet with zero-emission electric vehicles, the Memphis-based company announced Wednesday.\n\n“We have a responsibility to take bold action in addressing climate challenges,” said Chairman and CEO Fred Smith in a statement.","trending":"True"},{"heading":"Bow! Beyoncé is now the most-winning lady singer in Grammys history.","_id":"fd52fcfc-c62f-4e9f-a83c-a1eded41b248","_owner":"83f05366-1dab-4bd0-be63-69d21cd41e63","_createdDate":"2021-05-31T13:07:26.839Z","img":"https://i.ibb.co/hYdLFHC/news1.jpg","_updatedDate":"2021-06-07T11:25:32.713Z","date":"Sunday, 6 June 2021","category":"business","news":"Hear ye, hear ye! Beyoncé has taken her rightful throne in music history.  \nQueen Bey is now the most-winning female artist, and the most-winning singer (male or female), in the 63-year history of the Grammy Awards. \n\nShe has earned 28 trophies, including Sunday's wins for best music video for \"Brown Skin Girl\" and best rap performance for her\"Savage\" collaboration with Megan Thee Stallion. ","trending":"True"},{"heading":"'We are going to have to save ourselves,' Black community fights.","_id":"d9fb1354-0526-4809-aa30-78800e11965a","_owner":"83f05366-1dab-4bd0-be63-69d21cd41e63","_createdDate":"2021-05-31T13:06:50.353Z","img":"https://i.ibb.co/R69QXqH/news7.jpg","_updatedDate":"2021-06-07T11:25:35.866Z","date":"Sunday, 6 June 2021","category":"fintech","news":"Name a COVID-19 vaccine conspiracy theory circulating on social media, and hairstylist Katrina Randolph has heard it. So every time a client slides into her chair, she snips away at fears and misconceptions. \n\nNo, the vaccine isn’t an effort to sterilize Black people. It can’t alter your DNA. It won’t implant a microchip to track your movements. And no, people of color are not being used as guinea pigs.\n\nRandolph has put herself on the front lines of the Black community’s fight against COVID-19 vaccine misinformation, part of a network of barbershops and beauty salons working with Dr. Stephen B. Thomas, who runs the Maryland Center for Health Equity at the University of Maryland School of Public Health.","trending":"False"},{"heading":"Joe Biden quoted: I am looking forward to losing an hour of sleep... kind of.","_id":"da910e13-02f1-464b-a4a2-0ed274958e3d","_owner":"83f05366-1dab-4bd0-be63-69d21cd41e63","_createdDate":"2021-05-31T13:06:19.497Z","img":"https://i.ibb.co/QkpCQkw/news8.jpg","_updatedDate":"2021-06-07T11:25:41.687Z","date":"Saturday, 5 June 2021","category":"economy","news":"As someone who loves sleep, I'm looking on the bright side of losing an hour of it this weekend due to daylight savings time.\n\nSleep during the pandemic has been tough for a lot of people. For me, it's meant more trouble falling asleep, and once I finally do, more vivid stress dreams. Fun, right? That's why I like to get as much of it as I can, when I can.\n\nSo, my tactic for this weekend is pretty simple – getting in bed early! I've found that unwinding at night with a book is great way for me to give my mind a break from the stress of the day (and give my eyes a much-needed break from screens).","trending":"True"},{"heading":"We need a domestic terrorism law. Call these crimes what they are, for victims and America.","_id":"faacd157-7aa5-4f6e-aa89-3bee6edab3ac","_owner":"83f05366-1dab-4bd0-be63-69d21cd41e63","_createdDate":"2021-05-31T13:05:54.214Z","img":"https://i.ibb.co/rwJVWFT/news9.jpg","_updatedDate":"2021-06-07T11:25:50.782Z","date":"Saturday, 5 June 2021","category":"politics","news":"In 1983, a racist anti-Semite named Robert Jay Mathews founded “The Order,” a white supremacist neo-Nazi group vehemently opposed to the federal government, which Mathews believed was controlled by “Zionists.” \n\nThe Order sought to establish a homeland in the Pacific Northwest from which Jews and people of color would be excluded. To fund its operations, the group counterfeited currency and committed violent bank and armored car robberies.","trending":"False"},{"heading":"My show-biz parents were canceled for good reasons and bad. Let's cancel racism someday","_id":"0eb46655-bc41-4f71-846b-c261404cb180","_owner":"83f05366-1dab-4bd0-be63-69d21cd41e63","_createdDate":"2021-05-31T13:05:02.220Z","img":"https://i.ibb.co/5BdwKD0/news10.jpg","_updatedDate":"2021-06-07T11:25:45.060Z","date":"Saturday, 5 June 2021","category":"miscellaneous","news":"Larry Strauss\nMarch 13, 2021·5 min read\n\nTucker Carlson\nIn 1975, my mother, the actress Charlotte Rae, was a victim of cancel culture. She had landed a role on a new Norman Lear television series, but after only 13 episodes, the show was canceled.\n\n“Hot l Baltimore,” based on the Broadway play by Lanford Wilson, depicted the occupants of a run-down hotel, including sex workers, a gay couple and an undocumented immigrant, and this offended people. Some ABC affiliate stations, including WJZ in Baltimore, where the show took place, refused it a time slot.","trending":"True"},{"heading":"Sen. Marco Rubio: Amazon should face unionization drive without Republican support","_id":"0b3420e4-174d-4a95-a5ee-294d2a5d8055","_owner":"83f05366-1dab-4bd0-be63-69d21cd41e63","_createdDate":"2021-05-31T13:04:07.527Z","img":"https://i.ibb.co/WkS9dD1/news11.jpg","_updatedDate":"2021-06-07T11:26:05.114Z","date":"Friday, 4 June 2021","category":"education","news":"For the past several years, Amazon has waged a war against working-class values. The Silicon Valley titan uses anticompetitive strategies to crush small businesses, bans conservative books and blocks traditional charities from participating in its AmazonSmile program. Not surprisingly, it has also bowed to China's censorship demands.\n\nAmazon may be headquartered in America, but it considers itself a citizen of the world.\n\nNow, the company is facing a unionization effort at its warehouse in Bessemer, Alabama.\n\nThe move comes after a banner year for Amazon thanks to the COVID-19 lockdowns. But even after historic market gains, its corporate leadership fears the prospect of its workers having an increased say in working conditions, so it’s looking to crush the union vote.","trending":"True"},{"heading":"Doctor on the anniversary of COVID: 'Did not anticipate ... the public would not believe us","_id":"3bf969bb-53d1-4e15-bdae-e32b741593e4","_owner":"83f05366-1dab-4bd0-be63-69d21cd41e63","_createdDate":"2021-05-31T13:03:13.051Z","img":"https://i.ibb.co/4TB8144/news12.jpg","_updatedDate":"2021-06-07T11:26:08.845Z","date":"Friday, 4 June 2021","category":"marketing","news":"Thursday marks the first anniversary of when the greatest of nations was shut down by the smallest of viruses. March 11, 2020, was the day the World Health Organization declared COVID-19 a pandemic, cases were rising within our borders,and then-President Donald Trump could no longer credibly argue that the novel coronavirus would “magically disappear.”\n\nAt that time, there were roughly 1,200 cases in the USA and 40 deaths. One year from hell later and we have almost 30 million known infections and have lost more than 526,000 lives. The end is finally in sight, but it shouldn’t have taken us half a million dead mothers, fathers, sisters and brothers to get there.","trending":"True"}]
