[{"readtime":"4 min read","heading":"Let’s Talk - Belarus","author":"Dhruv Chincholikar","url":"https://www.finbitsindia.com/post/let-s-talk-belarus","_id":"704c4865-f822-4f63-82f2-3681c8026b00","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T20:50:31.961Z","_updatedDate":"2021-06-07T14:25:48.891Z","date":"31 May, 2021","news":"Covid-19. Israel Palestine. Biden-Harris. Vaccine supply choked. Lockdowns. Cyclones. This is the news we see on a daily basis. But silently, quietly and insidiously the world has another nudnik to deal with – the country of Belarus. A landlocked country nestled among Poland, Ukraine and Russia; the tumultuous history is one worth dwelling into. \n\nKey Points \n1. Alexander Lukashenko\n\nWho is he?\nHe is a Belarusian politician who has served as the first and only president of Belarus since the establishment of the office on 20 July 1994. \n\nLukashenko, 66, held posts in the Soviet Army and the communist youth organization and party when Belarus was part of the Soviet Union. Before the fall of the Soviet Union he rose to prominence. "},{"readtime":"4 min read","heading":"Elon’s Empire","author":"Dhruv Chincholikar","url":"https://www.finbitsindia.com/post/elon-s-empire","_id":"f54712be-d6e1-4a2d-ae96-4afcc4f51117","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T20:45:41.176Z","_updatedDate":"2021-06-07T14:26:03.265Z","date":"24 May, 2021","news":"Elon Musk. The name analogous to technology, space travel, electric vehicles, bitcoin and so much more! But how did his empire come about? It all started in the heart of South Africa where Musk was born and raised. From a young age, his ingenious ideas and unbounded intelligence have helped shape his career. Today Musk is among the richest people on Earth, with a net worth of 164 billion dollars; a far cry from his humble beginnings of living meal to meal.\n\nBrain Spark: Musk created and sold a video game at age 12 to a magazine, for $500. \n\nTimeline to Success \n\nZip2\n\nMusk, along with his brother Kimbal, set up Zip2 in 1995. It created maps and city guides which were also published in various newspapers. The company was sold for a record 307 million dollars in 1999 of which Musk made his first 7 million. \n\n\nBrain Spark: Musk dropped out of Stanford University two days after joining, after which he founded Zip2. \n\n\nX.com\n\nIn 1999, Musk co-founded X.com, an online financial services and e-mail payment company whose nascent growth was almost unheard of. Within the first few months, over 2,00,000 customers joined the service. This company eventually went onto merge with PayPal which was later acquired by ebay. \n\n\nBrain Spark: At age 17, Musk scored such a high score in an IQ test, he was made to retake it, citing foul play.\n\n\n\n\nSpaceX\n\nNow starts the real climb of his career. Set up in 2001, the goal of SpaceX was to reduce the gargantuan costs of space travel; the eventual long-term plan being - to help colonise Mars. In doing so SpaceX wants to help economise, democratise and minimise the waste associated with space travel. \n\nTheir first rocket to reach space was the Falcon 8 in 2008, and after that, it’s been unstoppable.  SpaceX's active reusability test program began in late 2012 with testing low-altitude, low-speed aspects of the landing technology. \n\nIt first achieved a successful landing and recovery of a first stage in December 2015 with the Falcon 9 Flight 20. NASA has signed multi million dollar deals with Space X and in 2020 it came to fruition, when NASA astronauts used a Space X rocket to reach the ISS."},{"readtime":"4 min read","heading":"Small Business Innovation During the Pandemic","author":"Anjali Patra","url":"https://www.finbitsindia.com/post/small-business-innovation-during-the-pandemic","_id":"3176d323-4099-47a3-bfd3-fc3eb1b51bdb","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T20:43:47.019Z","_updatedDate":"2021-06-02T20:43:47.019Z","date":"17 May, 2021","news":"“The value of an idea lies in using it.” The pandemic pushed the never expected before brakes, bringing the entire nation to a halt on a single day. This was something which had not been stated in Indian history before. But did the world really stop? If it didn’t, then what kept the wheels rolling? This is where the new creative ideas enter.\n\n\nWe observed a surge in various small businesses last year. A few of which were less popular in past and others were completely unheard of. These business ideas came out rather successfully in these testing times. These businesses even helped the bigger business to function smoothly.\n\n\nWhat exactly are small businesses?\n\n\nThey define small business as a privately owned corporation, partnership, or sole proprietorship with fewer employees. It has lesser revenue than a corporation or regular-sized business. These businesses are often hobby and interest oriented. A specific goal and interest that drives them in mind. Often used to display one’s talent or interest, these businesses also help in making a good fortune.\n\n\nSome of the thriving small business of India that bloomed during the pandemic:\n\nThe Cleaning Services\n\nThe Delivery Services\n\nThe Online Gift Store\n\nEd tech\n\nCyber Security Consultant\n\nE-commerce\n\nOnline reseller\n\nFreelance copywriter\n\nRemote Fitness\n\n\nThe cleaning or the disinfectant business had existed before the pandemic. The service came into action mostly during extreme times. But now that each moment has turned into an extreme, this service became a lifesaver. With buildings and places being routinely disinfected to curb the spread of virus; various cleaning companies saw an usurp in hike.\n\n\n\n\nThe delivery service is nothing sort of new to our knowledge. What made this service so crucial now than from before? At a time when people are confined inside with absolutely no contact with the outside world; the delivery guys made it possible for things to move from one place to another. From delivering groceries to deliver medicines; at present the delivery service has come at the service of immunocompromised people who are infected from COVID-19 or are still recovering."},{"readtime":"5 min read","heading":"Non-Fungible Tokens: GIFs being sold for millions?","author":"Apoorv Verma","url":"https://www.finbitsindia.com/post/non-fungible-tokens-gifs-being-sold-for-millions","_id":"b6f94f7b-a35a-48a9-b501-ddc09018c9ff","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T20:40:13.442Z","_updatedDate":"2021-06-02T20:40:13.442Z","date":"10 May, 2021","news":"Your digital existence, in the form of tweets, art, music or literally anything can now be monetized through Non-Fungible Tokens or NFTs, as they are lovingly known.\n\n\nTo be frank, your digital existence has already been monetized and sold off by Big-Tech; but this time, you can reap the dividends. All the cash will (hopefully) go into your pockets instead of the likes of Google or Microsoft. \n\n\nJack Dorsey did exactly the same. He sold his very first tweet as an NFT for $2.9 million. \n\n\nNow you can do the same, provided that you end up building something akin to Twitter so that you can justify the sky-high price of your ‘trolling-expertise’.\n\n\n\nThe tweet which was sold as an NFT for $2.9 million\n\nDisclaimer\n\nYou can sell your tweets if they are witty or funny enough, but this editorial just talks about the economic significance, or insignificance of NFTs. This is by no means a guide to create/buy/sell NFTs. Do your own research. PLEASE. You have been warned.\n\n\nWith that out of the way, let’s get going.\n\n\nWhat does an NFT even mean?\n\n\nBefore that, lets understand what fungibility means.\n\n\nIn economics, fungibility is essentially a measure of the interchangeability or exchangeability of assets or liabilities. \n\n\nFungibility isn’t a black and white metric and it can’t be classified binarily, it rather exists on a spectrum; with Gold being pretty fungible, cash being fungible to a good extent, cryptocurrencies being less fungible due to their digital traceability and NFTs being NOT AT ALL fungible, unsurprisingly.\n\n \n\nSimply put, NFTs are digital collectibles which cannot be exchanged or counterfeited because no 2 NFTs are identical, just like trading cards.\n\n\nExcept that these trading cards are digital, and through some technology (read ahead) you can verify their originality and diagnose whether they’re the real deal or not.\n\nRemember CricketAttax, which were the hype of the day back when IPL was just starting to make itself prominent? A digitally rendered CricketAttax card would suffice as an NFT, but don’t go ahead and try this, or you’re setting yourself up for multiple lawsuits (copyright infringement or something).\n\n\nWho authorizes the legitimacy of an NFT?"},{"readtime":"6 min read","heading":"Role of Insurance in Current Times","author":"Preet Ganatra","url":"https://www.finbitsindia.com/post/role-of-insurance-in-current-times","_id":"8973fd68-f5ed-43fd-9a77-769be19838db","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T20:38:12.918Z","_updatedDate":"2021-06-02T20:38:12.918Z","date":"3 May, 2021","news":"The idea of ‘protection against probable risk’ never carried as much weight among our citizens earlier as it does today. The onset of COVID-19, last year, instilled a sense of fear and uncertainty, not only among individuals and families but also businesses and the overall economy. Astronomical COVID-19 treatment bills from private hospitals and the rising healthcare costs transformed people’s perceptions about ‘Insurance’.\n\n\nBefore we hop onto understanding Insurance policies and the impact of COVID-19 on the industry, let’s understand some basics.\n\n\nInsurance: Meaning, Types & Industry Overview\n\n(Readers aware of the basics, kindly skip this section)\n\n\nInsurance is a legal contract between two parties i.e. the insurance company (insurer) and the individual (insured). Here, the insurance company promises to make good the losses of the insured on the occurrence of an uncertain event, like damage, loss or death. The insured pays a ‘premium’ in return for the promise made by the insurer. \n\n\nThe Insurance Mechanism\n\nTo be noted: The premium amount charged by the insurance company is determined using actuarial calculations, based on the extent of risk involved, the sum insured, the creditworthiness of the policyholder, any chronic illnesses or habits (specifically in case of health insurance), the age of the policyholder (as in case of life insurance) and various other relevant factors. \n\n\nBroadly, the Insurance products can be classified into two categories: \n\nLife Insurance:\nA contract very advantageous for every bread-earner of the family, life insurance assures financial protection of the dependents in an event of the untimely death of the individual. Additionally, the premiums paid towards a life insurance policy are tax-deductible under section 80C of the Income Tax Act, 1961.\n\n\nNon-Life Insurance:\nAlso known as General Insurance, this category includes several types of insurance policies for motor, health or disability, fire, marine shipments, property, etc. that aim to cover specific financial risks attached to these valuable assets. Simply, it covers anything but Life!\n\n\nDifferent types of Non-Life Insurance Policies\n\nIn India, the insurance sector is regulated by the Insurance Regulatory and Development Authority of India (IRDAI)."},{"readtime":"4 min read","heading":"How Content Marketing Helps to Make Money!","author":"Angad Preet Singh","url":"https://www.finbitsindia.com/post/how-content-marketing-helps-to-make-money","_id":"108861c1-b174-4184-9f55-b3251ea2097a","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T20:36:07.663Z","_updatedDate":"2021-06-02T20:36:07.663Z","date":"26 Apr, 2021","news":"Content is at the heart of all digital marketing campaigns and is the medium to reach your target audience. To be successful with content creation, you need to have a plan along with a specific goal and this is what content marketing is all about. Content marketing will focus on creating, guiding and distributing content to attract and retain a clear-defined audience.\n\n\nWhat is content marketing?\n\nContent marketing aims at providing relevant and useful content to the prospects, helping them solve their problems. It is a long-term strategic development aims at building relationship with your audience.  This helps online businesses to increase brand awareness, achieve better SEO ranking and engage in various digital channels. To take the benefits of content marketing we need a well framed strategy known as content strategy. This will help to specify the type of content to create, when to publish, how much elements to be considered and which audience to target. Effectiveness of your marketing campaigns can be measured through this strategy.\n\n\n\n\nWhy is it important?\n\n1. Pays to put your audience first\n\nAcross industries a shift in needs of the audience is addressed. Marketers need to apply different strategies if customer changes. It has a great ROI (Return on Investment). Good content is considered an asset for an online business that can generate profit in the form of more organic visits, brand mentions, and social media engagement. Studies show companies that run these campaigns get more traffic and leads compared to ones that operate on formal content strategy.\n\nIncrease in site visits by 55%.\n\n434% more pages indexed by search engines.\n\n97% more backlinks.\n\nOn an average 5X more leads are observed due to these strategies.\n\n\n2. Build brand awareness, trust and loyalty\n\nResearch strongly supports customer-first marketing- It is a win-win situation for both customers and brands when brands create content that educates and informs consumers. This determines how customer feel about your brand. Strength of your content accounts for 71% of how a brand performs. “Meaningfulness” in brand can increase wallet share by up to 9 times. This can be strategized by using various channels important one being search engine optimization."},{"readtime":"6 min read","heading":"Cannabis: From Dope to Hope","author":"Preet Ganatra","url":"https://www.finbitsindia.com/post/cannabis-from-dope-to-hope","_id":"17d98014-d1c9-45e9-9ffa-f03bf9a9a457","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T20:32:44.498Z","_updatedDate":"2021-06-02T20:32:44.498Z","date":"19 Apr, 2021","news":"Today, as the planet stands at the dawn of global annihilation triggered by climate change, every individual and business is obliged to adopt sustainable alternatives to all their utilities and practices, with a sense of urgency. Undeniably, efforts are being made in the form of afforestation, minimising carbon footprints, banning the use of plastics, keeping a check on pollution and much more. But in a country where the majority of the population is still battling poverty, adopting sustainable lifestyles seems far-fetched. \n\n\nSurprisingly, nature itself holds a highly effective solution to most of these pressing problems - in the form of a wonder plant - Cannabis - otherwise known as bhang, ganja or Marijuana (Yes, you read it right!) - but the non-intoxicating variety of this species - THE HEMP. \n\n\nAbout Hemp\n\nIndustrial Hemp (Cannabis sativa ssp. Sativa) is the non-psychoactive variation of Cannabis with the tetrahydrocannabinol (THC) content generally below 0.3%. THC is the psychoactive component that is responsible for the ‘high’ in Cannabis. Hemp has minimal THC and maximum cannabidiol (CBD). CBD largely neutralises the intoxicating effects of THC and has multiple other nutritional and therapeutic benefits. Simply put, Industrial Hemp is a non-intoxicating Cannabis that alone offers thousands of pan-industrial applications. \n\n\nDifference between the two species of Cannabis : \nIndustrial Hemp v/s Marijuana \n\nMarvels Of Hemp\n\nNow termed as a ‘blessing for humanity,’ Hemp is the only known natural resource that has more than 25,000 known end uses. From automobiles to apparels, medicines to cosmetics, fuel to paper, construction to animal husbandry and from food to biodegradable plastics, Hemp can be easily employed as the healthier, safer and more economical raw material in more than 40 industries, thus truly making it the most ‘sacred’ plant ever grown for mankind! \n\nPractically, the Hemp fiber can easily fulfil the world’s clothing requirement with only 1/4th the amount of water (as compared to cotton), without any additional chemical insecticides or pesticides, using lesser land, providing a higher yield and above all, protecting the richness of the soil and making it more fertile while doing all of this!"},{"readtime":"4 min read","heading":"PRINCE PHILLIP – The Silent Support","author":"Dhruv Chincholikar","url":"https://www.finbitsindia.com/post/prince-phillip-the-silent-support","_id":"a49a1fc8-d781-48cd-855b-7e24eb4334ed","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T20:30:16.599Z","_updatedDate":"2021-06-02T20:30:16.599Z","date":"12 Apr, 2021","news":"This Saturday we were treated with the unfortunate news Prince Phillip, The Duke of Edingburgh’s passing. He lived to be 99, saw two world wars and upheld a 73 year marriage with Queen Elizabeth II. But who was this charismatic, pragmatic man that has left such a lasting impression on the royal family? \n\n\n\n\nPrince Phillip was born into royalty. His ancestry can be traced back to the Greek and Danish royal families. As a child he was moved around from country to country. His family fled Greece and moved to France when he was young. He could speak French, English and German fluently! He later went on to serve in the Royal Navy after graduating to of his class in the academy in 1939, aged just 18.  During the Second World War he fought for the British, against the Germans. Promotion to lieutenant followed on 16 July 1942. In October of the same year, he became first lieutenant of HMS Wallace, at 21 years old one of the youngest first lieutenants in the Royal Navy.\n\n\nTEATalk - Three of his sisters were married to German men, during the rise of the Nazis. Infact he fought against his brothers-in-law during World War II!\n\n\nDuring this period, his courtship with then Princess Elizabeth begun. They would keep in touch via letters. Eventually in 1946, he would give up his Greek and Danish titles and take on his mother’s name, Mountbatten. The day before the wedding, King George VI bestowed the style of Royal Highness on Philip and, on the morning of the wedding, 20 November 1947, he was made the Duke of Edinburgh, Earl of Merioneth, and Baron Greenwich of Greenwich in the County of London. Philip and Elizabeth were married in a ceremony at Westminster Abbey, recorded and broadcast by BBC radio to 200 million people around the world. And thus began one of the longest marriages in the Royal Family!\n\n\nTEATalk -  Since his siters were married to German Nazis, they were never invited to the wedding!"},{"readtime":"2 min read","heading":"The Story of your Carbon Footprint","author":"Abhishek Doppalapudi","url":"https://www.finbitsindia.com/post/the-story-of-your-carbon-footprint","_id":"7077a854-425e-4977-88f3-978f4ab91ba2","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T20:28:55.058Z","_updatedDate":"2021-06-02T20:28:55.058Z","date":"5 Apr, 2021","news":"Hi There! This week we are planning to do something different. We would love to highlight the story of one particular company that caught our interest. We believe it is a company that our daily readers should know about and engage with as it would be of much help to society. \n\n\nWren is a website application that enables you to offset your carbon footprint. Anytime you travel by car, use electricity, switch on the AC in this torrid heat, you inadvertently release carbon dioxide and other gases into the air as a by-product. Wren aims to tackle that challenge by creating a business wherein you pay them a subscription fee to offset the carbon dioxide that you emit into the air. The subscription fee that you pay to Wren enables them to create a Wren Climate Fund. That fund then makes investments into environmental projects across the globe! \n\n\nHow Wren Works!\n\nWhen you visit their website, they direct you to a link where you can calculate the quantity of emissions you produce based on the country that you live in and your current lifestyle. \nLink: https://www.wren.co/ \n\nOnce you calculate the amount of Carbon dioxide you produce, Wren then displays subscription plans that you can choose from to reduce your carbon footprint, negate it completely, or create a net positive impact by investing to remove twice the CO2 from the atmosphere as you are currently producing. \n\n\nOnce you decide on a subscription plan, you can see where your money is being invested and the impact your subscription is having on saving the planet. Quite a sustainable business model, we must say! If you are conscious about your carbon footprints and want to save the environment, consider Wren!\n\n\nSome interesting projects that are a part of Wren's investment portfolio include:\n\nClean Cooking Fuel for refugees\n\nTech-enabled rainforest protection \n\nRegenerative agroforestry \n\nCommunity Tree planting\n\n\nThe reason we bought this business to your attention is to address the issue of Climate change."},{"readtime":"5 min read","heading":"The Pin-interesting Business Model!","author":"Tanvi Bhamare","url":"https://www.finbitsindia.com/post/the-pin-interesting-business-model","_id":"eb985a5c-2859-4904-8b6a-c46ae6e58e84","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T20:27:13.406Z","_updatedDate":"2021-06-02T20:27:13.406Z","date":"29 Mar, 2021","news":"Pinterest is a visual discovery engine for finding ideas like recipes, home, style expression and it is now a hub to find ideas and inspiration on the net.\n\n\n\n\nThe History of Pinterest : \n\nPinterest is an American image sharing and social media service designed to enable savings and discovery of information on the internet using images and animated gifs and videos in the form of pinboards. With billions of pins on Pinterest, you will always find ideas, creative photos, and inspiring artists across the globe. \n\n\nAs of August 2020, Pinterest had over 400 million monthly active users. It's created by -\n\nBen Silbermann, Paul Sciarra and Evan Sharp. \n\nIt's based in San Francisco, operated by Pinterest, Inc. and was created in 2009 approximately 11 years ago. \n\n\nWHAT ARE PINS? \n\nPins are bookmarks that people used to save ideas they love on Pinterest. People can search for them and save the ones they like and later click on the same pin to learn more about them. If you are a business owner then definitely you can create a pin to exhibit your products and ideas in front of the view and also you can link them back to your website. This can be called as using pins for business use. There are several artists and sellers who have created multiple pins to sell their products online. \n\n\nHere are some golden rules of Pinterest! \n\nShare interesting and quality items\n\nShow consideration for your followers\n\nBe selective in pinning activities\n\nPin responsibly\n\nGive credit where credit is due\n\nProvide the context for your pins\n\nLimit the information you share\n\nAllow others to pin your images to drive traffic, sales, and audience. \n\nGeneral Pinterest Stats :"},{"readtime":"6 min read","heading":"How Augmented Reality will completely morph the automotive industry?","author":"Apoorv Verma","url":"https://www.finbitsindia.com/post/how-augmented-reality-will-completely-morph-the-automotive-industry","_id":"5db72bc9-c337-4bb8-9ff5-191207905d1a","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T20:25:44.490Z","_updatedDate":"2021-06-02T20:25:44.490Z","date":"22 Mar, 2021","news":"Remember that friend of yours who is a Pokémon-Go fanatic and also dreams of incorporating the same technology while building the next Gigafactory? You are going to regret dismissing him, and his idea after reading this article. The technology which I am referring to is ‘Augmented Reality’. \n\n\nIt honestly is just a fancy-pants term for a relatively intuitive concept. You just superimpose digitally created 3-D imagery on everyday objects and utilities, and that too in real time. You are then able to ‘augment’ the tangible ‘reality’ by incorporating digitally produced attachments onto it; Hence, the term Augmented Reality. The short-form for it is AR, unsurprisingly. \n\n\nNow the basic requirement for letting the below ideas assimilate in your head has been met with, how does AR make any relation with the dream of that friend of yours? \n\n\nThe ideas which are presented below are arranged to accommodate an ocean-like flow, ranging from how AR is useful in manufacturing a vehicle to how your driving skills will improve in quantum leaps, and how AR will eventually be able to save these puny lives of ours. Also, you will eventually realize that you have been living under a rock in a world which is slowly edging closer to developing a Jarvis, for every vehicle out there.\n\n\nFirstly, let us realize how AR will exponentially increase the efficiency and reduce the time required to manufacture vehicles.\n\n\nImagine being an automobile-designer for a moment. You are sitting with your compatriots and brainstorming over new designs, and you get struck by a one-in-a-million idea, right out of the blue. But now you’ve got to make a clay model of it, depicting every edge of that design of yours, and in the process, you lose track of how the chassis will beautifully converge into the rear bumper. I am serious here, clay-modelling is heavily used in brainstorming and finalizing designs.\n\n\nNow only if you were a designer in Ford, you would’ve been using Microsoft’s HoloLens, a holographic wireless headgear, with a built-in computer, which assists you in churning out designs and introduce changes to it."},{"readtime":"5 min read","heading":"Oh! ‘Dear’ Fuel...","author":"Preet Ganatra","url":"https://www.finbitsindia.com/post/oh-dear-fuel","_id":"1e66fd5d-1f40-4ba8-977d-e442ac82d503","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T20:23:15.644Z","_updatedDate":"2021-06-02T20:23:15.644Z","date":"15 Mar, 2021","news":"“Petrol! Petrol!” resonated in all pockets of the city, as petrol scores a century!\n\nOn 17th February, 2021, retail petrol prices crossed the psychological three-figure mark of ₹100 in Sri Ganganagar, Rajasthan and subsequently in Mumbai. Prices have been above ₹90 per litre in most other cities as well. Concurrently, retail prices of diesel have also inched towards all-time-highs of above ₹85. High fuel prices have remained unchanged for 15 consecutive days and customers are paying through their nose, having little hopes for any price-cuts. The issue is acutely turning into a game of political football, thereby triggering unending debates and bickering. Here are all the causes, facts and figures you must know to clearly understand the problem.\n\n\nOverview\nCrude oil (also known as ‘black gold’), originally discovered during the industrial revolution, has over time become the single most important source of energy and a crucial component of our daily lives. India is ranked as the third-largest primary energy consumer in the world, after the USA and China, with the petroleum products’ consumption volume being approximately 211.03 million metric tonnes in the fiscal year 2019 (as per the Ministry of Petroleum and Natural Gas). Since inland production cannot suffice this massive demand, more than 80% of the consumption is met via imports. Consequently, any fluctuation in the global Brent crude prices has a direct and sizable impact on the oil prices in the country. Our top crude oil suppliers include Saudi Arabia and Iraq.\n\nUnderstanding the International Factors\nLike any other commodity, the prices of crude oil are determined by the supply and demand dynamics. Last year, the demand for crude oil saw a steep fall due to the COVID-19 pandemic. In April 2020, crude oil prices collapsed to about $20 per barrel, forcing most of the oil-supplying states to cut down their production. As the economies opened up, prices got restored to $40 per barrel and remained steady for five months until the end of October.\n\nHowever, as the vaccine is rolled out and the demand is expected to improve, the price of Brent crude increased by more than 50% in February 2021 and crossed the $60 per barrel mark."},{"readtime":"6 min read","heading":"IT. More than just a movie…","author":"Khooshmin Mirza","url":"https://www.finbitsindia.com/post/it-more-than-just-a-movie","_id":"124a9aff-f72e-4506-8ffd-ae274d9631c0","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T20:21:19.000Z","_updatedDate":"2021-06-02T20:21:19.000Z","date":"8 Mar, 2021","news":"On 25th February, 2021, the Centre notified the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (‘2021 Rules’) under S.87 of the Information Technology Act, 2000. \n\n\nThe primary objective behind framing the said rules:\n\nTo strengthen grievance redressal mechanisms and, \n\nTo have a ‘soft-touch’ oversight mechanism in relation to social media, digital media and OTT platforms. \n\n\nIndia’s growing online presence has given a platform to its citizens from all income backgrounds to share their opinions, seek information and become a part of this burgeoning virtual world that leaves no voice unheard. However, certain ‘virtual evils’ by the name of fake news, morphed images, obscene content, etc. have fomented an environment of disharmony and violence, which prompted corrective measures from the Government. \n\n\nCountdown to the 2021 Rules…\n\n \n\n3… Therefore the Ministry of Electronics and Information Technology (MEITY) framed a draft Information Technology (Intermediary Guidelines) Rules, 2018, thereby proposing an amendment to the previously existing Information Technology (Intermediary Guidelines) Rules, 2011 (‘2011 Rules’). \n\n\n2… The said draft rules were then released in the public domain in December 2018, inviting comments and/or counter-comments from relevant stakeholders of the public. \n\n\n1… Further, there has been a significant spike in digital media consumption, with people opting for OTT platforms (added boost due to Covid-19). Lack of content regulation on OTT platforms and its resultant complaints pushed the need for an oversight mechanism.\n\n\n0… After relevant analysis of the public comments so received and the issues surrounding OTT platforms, the central government notified the 2021 Rules on February 25th, 2021. These now issued rules are an amendment to the 2011 Rules with their roots set in the 2018 draft IT Rules.\n\n\n\nUnion Minister of MEITY Mr. Ravi Shankar Prasad and Union Minister of the Ministry of Information and Broadcasting Mr. Prakash Javadekar addressing a Press Conference on Feb 25th, 2021 \n \n\nThe Building Blocks…"},{"readtime":"3 min read","heading":"ESG: Investments of the future!","author":"Husain Ghadiali","url":"https://www.finbitsindia.com/post/esg-investments-of-the-future","_id":"90365341-e4cb-4ef0-bdfd-c3eccd623e7e","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T20:19:47.627Z","_updatedDate":"2021-06-02T20:19:47.627Z","date":"1 Mar, 2021","news":"What is ESG investing?\n\nESG investing is a relatively new method of identifying companies to invest in, based on the three major factors. ESG stands for environmental, social, and governance. These are the three factors based on which the sustainability and societal impact of investment are gauged. It extrapolates these factors for each company, based on which the company is rated. These ratings determine the favorability of an investment in that company.\n\nNow, each of these factors has multiple sub-factors within them which play a role in the final rating. For instance, factors such as air and water pollution, deforestation, waste management, and many more, are all calculated to finally contribute to the ‘environmental’ factor.\n\nESG investing aims to fulfil the Sustainable Development Goals laid down by the United Nations, which are a collection of 17 interlinked global goals designed to attain a better and more sustainable future for all.\n\n\nHow is it different from the traditional way of identifying an investment opportunity?\n\nThe traditional way of gauging a company is by looking at its financials and factors such as how profitable the company is, or how the sales were. If one delves a little further, one may study the management and get reviews about the functioning of the company. However, what ESG investing focuses on is sustainability. It takes into consideration much more than the factors considered by the traditional methods of investing.\n\n\nWhat are some factors considered under ESG?\n\nEnvironmental: Carbon change and carbon and emission, Air and water pollution, biodiversity, deforestation, energy efficiency, waste management, water scarcity, etc.\n\n\nSocial: Customer satisfaction, data protection and privacy, gender and diversity, employee engagement, community relations, human rights, labour standards, etc.\n\n\nGovernance: Board composition, Audit committee structure, bribery and corruption, executive compensation, lobbying, political contributions, whistleblower schemes, etc.\n\n\n\n\nESG Investing in India\n\nESG investing is in its nascent stage in India and is not as widely used. However, we are seeing signs of its rise as more companies are realising the importance of sustainability. “Practice of ESG helps reduce cost, gives new sources of revenue, access to new talent, and brings you, new consumers. It is another quiver for companies to become more resilient,” says Anirban Ghosh, Chief Sustainability Officer at M&M."},{"readtime":"4 min read","heading":"The Black Horse of the Ecommerce industry!","author":"Tanvi Bhamare","url":"https://www.finbitsindia.com/post/the-black-horse-of-the-ecommerce-industry","_id":"e1b08680-45ae-4217-8ada-d8d0bf6b9804","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T20:03:54.876Z","_updatedDate":"2021-06-02T20:03:54.876Z","date":"22 Feb, 2021","news":"It is hard for a person to quit a stable job at the age of 50 and think about starting a business from scratch. Well, had it been easy, the exemplary story of the brand Nykaa and its founder Falguni Nayar would not exist. She bid adieu to a well-established career to launch her entrepreneurial dream - The Brand: Nykaa! \n\n\nNykaa is an Indian Lifestyle retailer of beauty, wellness and fashion products that was founded by Falguni Nayar in 2012. It's a unicorn start-up and as of 2020 was valued at $ 1.2 billion. Falguni Nayar was a former Managing Director at Kotak Mahindra capital company before she founded Nykaa. It was launched as an E-Commerce portal offering a range of beauty and wellness products. Nykaa it got its name from the Sanskrit word Nayaka which means 'one in the spotlight'! The meaning of this name is epitomized in the growth story of this start-up that has gone from strength to strength to become of the most popular brands in the country!\n\n\nTHE MARKETING STRATEGY: \n\nMany companies have marketing strategies that help them to grow and expand in the world of business and here’s what Nykaa’s strategy is! Nykaa's 360 degree coordinated marketing and content strategy developed over the last seven years made it one of the largest omnichannel beauty players in the country. For an online retailer like Nykaa customer experience is a key component of a robust customer retention strategy. The company has said that it adopts this 360° marketing strategy to promote products but on the same level influencers play a vital role for the company too. The brand has been leveraging social media platforms to promote its products which is evident from the marketing strategy that they have adopted aggressively in the last few years. The current covid-19 pandemic has caused a tectonic shift in marketing strategies and Nykaa has followed suit by roping in more influencers to promote the brand.\n\n\n\n\nInfluencer Marketing Strategy: Introduction\n\nNykaa uses the influencer marketing strategy which involves a business promoting its products and services by partnering up with popular social media users, bloggers, content creators or vloggers. Nykaa mainly operates in two segments in the retail fashion products industry and they are:"},{"readtime":"5 min read","heading":"The IPO Rush","author":"Ishaan Shetty","url":"https://www.finbitsindia.com/post/the-ipo-rush","_id":"6b94f649-8303-46a2-88a9-31569b71c9d7","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T19:56:10.648Z","_updatedDate":"2021-06-02T19:56:10.648Z","date":"15 Feb, 2021","news":"IPOs are subject to euphoria please read this whole article carefully (read in flash speed) \n\n\n“Risk hai toh Ishq hai”, nope, we are not talking about how your valentines’ day went by, we are quoting a famous dialogue from Scam 1992: The Harshad Mehta Story, a Hindi crime drama web series. This article is not a review about the movie but the quote is the perfect start to this edition of our newsletter, “The IPO Rush”. You ask Why? More than 40 Initial Public Offering (IPOs) were issued in the calendar year 2020 as firms went in search to increase their equity exposure for their capital structure. And listing gains? Burger King made its debut on Dalal Street with an upside of 130%. \n\n\n\n\nAn IPO as the name suggests is a route wherein the company enters the stock market offering shares to the public. Most of these listed companies are privately held by their promoters. However, the promoters might have the urge to get public money, as they might not have adequate funds for setting up or running the business in the long term. Hence when you buy or get allotted shares in the primary market (IPOs) the money goes straight into the pockets of the company whereas when you buy shares in the Secondary market (on NSE/BSE for example), the money goes to someone who currently is owning those shares. \n\n\nHave you previously burnt your fingers in IPOs? Don’t worry, this article will have you covered and you will most definitely leave learning the ABC’s of investing in IPOs. \n\n\nYou need to do some homework before you apply for an IPO and the best part is that all this information can be found under one roof, i.e., the Draft Red Herring Prospectus. \n\n\nLet us walk you through the process of investing \n\n\nThe background of the promoters and the company is the FIRST thing that you need to study before investing. You really would not want to end up in another DHFL scam ;). There is a website which helps you check the default history of a promoter, www.watchoutinvestors.com.\n\n\nHave a close eye on two things; first, the ‘why’. Why is the company opting for the IPO route to raise money? Second is the promoter’s stake. A low promoter stake shows a lesser commitment by the promoters. \n\n\nHow is the price of a share determined?"},{"readtime":"5 min read","heading":"Drones, agriculture and the road that lies ahead","author":"Apoorv Verma","url":"https://www.finbitsindia.com/post/drones-agriculture-and-the-road-that-lies-ahead","_id":"d728bb56-f286-4f4a-ba52-391a478409fa","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T19:54:13.700Z","_updatedDate":"2021-06-02T19:54:13.700Z","date":"8 Feb, 2021","news":"You have seen cars go autonomous. You have also seen delivery fleets get automated with the help of drones.\n\n\nNow you will see how the agricultural-sector is getting autonomous. Don’t worry, this technology won’t put any farmers out of their livelihoods, in fact, this will enhance everything from the food coming on your plate to the efficiency with which it is being cultivated. \n\n\nWhat I am talking about is the integration of modern information and communication technologies with agriculture. \n\n\nThere is also a general term for it which is thrown around a lot, and you may have heard it too. \n\n\nIt’s called the Internet of Things, or the IoT. It is just a fancy term which refers to the hardware which can be controlled using a smartphone, in many cases remotely from any location on the planet, through the Internet.\n\n\nNow let me throw light on this from an Indian farmer’s point of view. Their woes are plentiful and pretty valid at the same time. What’s simply beautiful is that each of these problems are dealt with ingeniously using modern day tech. Once you take a look at these gizmos, it’s almost scary to notice that every stage has a tailor-made automated solution for assistance.\n\n\nSo, if you tend to tinker around with your Raspberry pies and Arduinos for days, chances are you can invent something which may eventually be used in the frontlines.\n\n\nSo, let’s get going.\n\n\nStarting-off with irrigation, a Gurgaon based start-up Energy Bots Pvt Ltd has launched a GSM based three-phase IoT device, which gives farmers the ability to control watering-times remotely, just by giving a missed-call or sending a message to the device.\n\n\nAs claimed by their product specialist Parth Bhatt, Energy Bots have developed this GSM operated microcontroller which uses various sensors to evaluate certain parameters like humidity level, moisture content, temperature and soil type. This data is then relayed to the central console which controls the pump mechanics by either switching them on or off and checks the water level in tanks simultaneously."},{"readtime":"5 min read","heading":"Abortion & Law","author":"Dhruv Chincholikar","url":"https://www.finbitsindia.com/post/abortion-law","_id":"14e1d375-a3d3-42a3-a817-04e6bf9530de","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T19:52:43.780Z","_updatedDate":"2021-06-02T19:52:43.780Z","date":"1 Feb, 2021","news":"The love between a mother and her child is considered divine, the epitome of affection and sacrifice. Does that mean love is only associated with life? Can’t a mother make a decision that is based on her inability to provide a good quality of life for her unborn child? Is that not love in itself? But then again, shouldn’t that child have a voice?\n\n\nOne of the most pressing issues in today’s world is the ability/inability to make that decision. Abortion is the deliberate termination of a human pregnancy. The reasons may include socio-economic status, threat to the mother and/or mental deficits to the foetus. When properly done, abortion is one of the safest procedures in medicine, but unsafe abortion is a major cause of maternal death, especially in the developing world. (Source: https://www.plannedparenthood.org/). \n\n\nPro-Life v/s Pro Choice\n\nThere are two distinct schools of thoughts. ‘Pro-Life’ supporters believe in the defending the rights of the foetus. ‘Pro-choice’ supporters believe in defending the rights of the woman. Here is an extract of a hypothetical conversation between the two groups.\n\n\n\n\nLaws around the world\n\n➢ USA:\n\n• While abortion has been legal since the landmark Supreme Court decision of Roe vs Wade in 1973 there has been considerable pushback over the decision.\n\n\n• Several polls have found the American public equally divided over the issue. Even politicians have had opposing views. Trump is pro-life while Biden is pro-choice.\n\n\n• If an abortion case reaches all the way to the supreme court again, there is considerable reason to believe that abortion for non-medical purposes may revoked.\n\n\n➢ UK:\n\n• Abortion has been legal since 1967 and allows it to take place until 24 weeks after gestation.\n\n\n• Two doctors must agree that having the baby will pose a risk to the life of the mother, the foetus or impact the mental health of the woman.\n\n➢ New Zealand:\n\n• Abortion has been legal since 1977 and as recently as 2020, under Ardern, abortion has also been decriminalised.\n\n\n• Assent must be taken from two doctors in agreement.\n\n\n➢ Latin America\n\n• Abortion is illegal in most of Latin America. Few countries permit it only in order to preserve life of the mother.\n\n\n• In a landmark decision, on 30th December 2020, abortion was legalised in Argentina up to 14 weeks after gestation."},{"readtime":"5 min read","heading":"Budget 2021: The Average Tax-paying citizen and his expectations","author":"Apoorv Verma","url":"https://www.finbitsindia.com/post/budget-2021-the-average-tax-paying-citizen-and-his-expectations","_id":"dc682f3e-d46a-4a88-b0ce-2619b400f327","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T19:49:08.288Z","_updatedDate":"2021-06-02T19:49:08.288Z","date":"25 Jan, 2021","news":"It is THAT time of the year again. On the first of February, 2021, the Finance Minister Nirmala Sitharaman will lay down the financial-cum-developmental roadmap for this year by presenting the budget in the parliament, like it has been done for the past decades. So, what is different this time?\n\n\nThe stakes.\n\n\nThey’ve never been higher.\n\n\n\n\n2020, as year, was certainly VERY eventful, to say the least. The amount of turmoil COVID-19 implicated upon every single component of the globalist architecture is pretty apparent. Now that the water is under the bridge, albeit partially, a gargantuan task lies ahead of every single nation, especially India. The incredulous task to rebuild, not just on shoddy foundations comprised of bailing-out mega-corporations, but on a robust trajectory, which happens to be ‘Antifragile’, in the words of Nassim Nicholas Taleb.\n\n\nSo, what does the common man, the average tax-paying and law-abiding citizen expect from this year’s budget proposal? \n\nIt is pretty much a universal agreement between every analyst and average consumer/citizen alike that the economic output of various sectors needs to be brought back up to pre-COVID19 levels, AT LEAST. And it certainly makes a lot of sense to aim for that minimum baseline.\n\n\nTaxation policies:\n\nThe top-most expectation of the tax-payer would be ‘lower-taxes’, ironically, as every citizen genuinely wants and needs more to spend for themselves, but that’s not all. \n\n\nTax relief:\n\nLet us begin with the results of some surveys undertaken by independent think-tanks regarding the average citizen’s outlook regarding taxes and what taxation policies should be undertaken in the 2021 budget. Around 40% of the surveyed populace stresses on the fact that tax-relief should be the theme around which the entire 2021 budget is built upon. This actually makes a lot of sense as it is pretty apparent that literally everyone’s income has been negatively impacted due to the widespread lockdowns. It also carries a lot of weight, as nearly half the population is desperate for some much-needed financial respite. \n\n\nWidening tax-slabs:\n\n47% of the sample had their major demand to be that of widening of the tax-slabs. Since inflation does not seem to reduce in the coming financial year(s), the growth in the income of salaried individuals will be limited and it will certainly impact their spending powers."},{"readtime":"5 min read","heading":"The Abraham Accords: “Peace for Peace”","author":"Abhishek Doppalapudi","url":"https://www.finbitsindia.com/post/the-abraham-accords-peace-for-peace","_id":"f1210b48-ba7b-4ed8-a5b6-09f4f384427c","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T19:47:20.784Z","_updatedDate":"2021-06-02T19:47:20.784Z","date":"18 Jan, 2021","news":"With just two days left for President Trump’s tenure to end, 20th January hopefully marks the end of what has been a chaotic, polarized, and horrid few months in the United States. The tension around the controversial elections and the rhetoric of Trump’s supporters morphed into an insurrection with right-wing extremists storming the Capitol building on January 6th, 2020. Under federal law, Congress must meet on 6th January to validate the election result by counting the electoral votes. The Vice President presides over the session and officially declares the winner after they complete the counting. Demonstrators stormed into the Capitol building, which disrupted Congress proceedings, and the clash with the Capitol Police resulted in the deaths of law enforcement personnel and protestors. The pandemic and political fervor ravaging the US and the world at large resulted in the sidelining of an occurrence of significant consequence to the peace and future of the Middle East: The Abraham Accords. Although these Accords garnered a tepid response from the international media, this agreement between Israel and two Gulf Nations - The United Arab Emirates (UAE) and the Kingdom of Bahrain marks the beginning of a new chapter for Arab-Israeli politics. \n\n\nThe Abraham Accords\n\n\n(From L-R) Bahrain Foreign Minister Abdullatif al-Zayani, Israeli Prime Minister Benjamin Netanyahu, US President Donald Trump, and UAE Foreign Minister Sheikh Abdullah bin Zayed during the Peace Accord signing ceremony in the White House.\n\nThe Abraham accords are a series of agreements and joint statements between Israel and Bahrain and Israel and the UAE, with the United States acting as the mediator of this agreement. The accords were officially signed in the White House on September 15th, 2020. The accords signify the official normalization of relations between Israel and the two Gulf countries. UAE became the third Arab country after Egypt in 1979 and Jordan in 1994, to formally normalize its relationship with Israel. Bahrain followed suit and became the fourth Arab country to recognize the state of Israel. \n\n\nThe agreement between UAE and Israel was signed a month before (August 15th) the agreement between Israel and Bahrain, but both these agreements were collectively signed on September 15th at the White House. Before the agreement between Israel and the UAE, there was no official relationship between the two nations, but informal trade channels to conduct business and unofficial communication was active."},{"readtime":"7 min read","heading":"All things BREXIT!","author":"Khooshmin Mirza","url":"https://www.finbitsindia.com/post/all-things-brexit","_id":"f916d5e8-1980-479f-af06-9f3f83f710b1","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T19:44:02.975Z","_updatedDate":"2021-06-02T19:44:02.975Z","date":"11 Jan. 2021","news":"Four arduous years hence, Britain (UK) left the European Union (EU or the bloc) on 31st December, 2020; beginning the new year as a European country beyond the EU’s jurisdiction, free to charter its own course politically and economically. \n\n\nWhile it officially withdrew in January 2020, Britain spent the following 11 months operating under EU rules in what was called the ‘transition period,’ during which the two sides underwent extensive negotiations in re their future relations. The result-a trade agreement spelling out new rules of work, trade and life. Thereby finalizing Britain’s exit from the bloc i.e. the BREXIT. \n\n\nAs Britain prepares to embrace new opportunities and take on new challenges, allow me to take you through its journey of becoming the first and only country to formally leave the EU. \n\n\n\nA farewell message on the White Cliffs of Dover from Sky News\n\n\nA read…back in time!\n\n \n\nIn the year 1957, the Treaty of Rome was signed by France, West Germany, Belgium, Italy, Luxembourg and the Netherlands, in order to facilitate economic cooperation post WWII. It led to the establishment of the European Economic Community (EEC), predecessor to today’s European Union.\n\n\nIn the 1960s, the UK applied for membership to the EEC twice, only to be declined by France both the times. In 1973, the UK finally joined the EEC.\n\n\n1975 saw the UK holding its first nationwide referendum (‘public vote’) on the question of its membership in the EEC. The people voted to stay in the bloc - 67% to 33%. \n\n\nContrary to the above results, tensions between the EU and the UK seemed to burgeon over the years.\n\n\nThe result? Another referendum…\n\n \n\nThe Referendum \n\nIn 2015, Britain’s then Prime Minister David Cameron’s prospect of returning to office stood largely dependent on the question of Britain’s position with respect to the EU. \n\n\nHis Conservative Party faced considerable pressure from the United Kingdom Independence Party (UKIP), a small and staunchly Eurosceptic party, that had managed to garner support from not only the people but also certain Conservative Party figures, owing to its pro-Brexit stance."},{"readtime":"6 min read","heading":"Bitcoin: Decrypted!","author":"Preet Ganatra","url":"https://www.finbitsindia.com/post/bitcoin-decrypted","_id":"bfecdef3-6f9a-417a-9ca0-d051a5e88919","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T19:41:10.553Z","_updatedDate":"2021-06-02T19:41:10.553Z","date":"4 Jan, 2021","news":"Launched hardly over a decade ago, Bitcoin today finds itself more lustrous than ever. Despite being declared dead for precisely 389 times, this cryptocurrency has now surged to an all-time high-price of approximately $34,000 per bitcoin. Its highly controversial and volatile nature makes it difficult for us to classify it clearly as a currency, an asset class or a mere store of value. But before we attempt to do so, let’s first understand what the idea behind bitcoins is.\n\n\nThe Origin\n\nThe first-ever mention of bitcoin was made in a whitepaper, written by a pseudonymous Satoshi Nakamoto, released in the year 2008. They consequently launched the Bitcoin software in January 2009. The identity of the author(s) remains a mystery to date. The probable reasons for Satoshi being anonymous are privacy (from the media, governments and banks) and protection (since the idea threatens the globally existing banking and monetary systems).\n\n\nWhat is Bitcoin?\n\nBitcoin is the world’s largest cryptocurrency (digital money) by market capitalisation. As explained in Bitcoin's whitepaper, its meaning is deceptively simple- “A peer-to-peer electronic cash system”, i.e. bitcoin is a software-based currency that facilitates instant payment between two parties, not necessarily humans. \n\n\nBut digital-wallets and instant money transfer options already exist, so why Bitcoin? Because the existing widely-used online payment platforms require a third-party, i.e. the banks or credit/debit card companies, that ensure smooth and secure transactions, maintain a record of the same and charge us a cut as transaction fees. \n\n\nConversely, the whole idea behind bitcoins is to not involve any third party, be it a bank or the government. It only requires two parties willing to transact. It promises lower transaction fees and is operated in a decentralised manner, unlike the government-backed currencies, and is therefore not accepted as legal-tender currency. But its revolutionary nature, the ease of transactions offered and the opportunities unfurled in the world of ‘Fintech’ and ‘Internet of Things’, have led to its popularity. "},{"readtime":"4 min read","heading":"Let's VAX!","author":"Dhruv Chincholikar","url":"https://www.finbitsindia.com/post/let-s-vax","_id":"b7df4bcf-74b4-4639-b670-930ace25a76e","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T19:38:29.058Z","_updatedDate":"2021-06-02T19:38:29.058Z","date":"Dec 28, 2020","news":"Vaccines, a prick of sustenance or a stab to purgatory? The very premise of a vaccine has been a hotly contested one, with extreme views coming into the limelight. So, what’s all the fuss about? Let’s take a jab at it.\n\n\n\n\nBrain Poke–Did you know bananas and human beings share 50% of their DNA? *in minion voice*“BANANAAAAAAAAAAA”\n\n\n\n\nWhat are vaccines?\n\nVaccines are a substance whose purpose is to provoke an immune response from the body; the production of antibodies. What exactly does this mean though? Basically, a vaccine contains a ‘watered down’ form of a bacterium/virus/pathogen or a substance which can mimic the same; tricking the body into assuming that it is under attack. The body will produce antibodies to fight the alleged attacker. So, when the body is actually exposed to said bacterium/virus/pathogen, it is already prepared to neutralise the threat. The body has the answer key even before it sees the question paper. Seems almost like magic, doesn’t it?\n\n\nBrain Poke – The first vaccine was developed by Edward Jenner in 1790 to be used against smallpox. One of mankind’s greatest scientific accomplishments has been the complete eradication of smallpox from human race.\n\n\n\n\nHow are vaccines developed, tested and approved?\n\n\n1. Development\n\nThe development starts in many ways. Part of a deactivated virus, bacterium, antigen or protein mimicking compound is evaluated. \n\nThe concoction will have more ingredients like diluents to ensure the dosage is in correct proportion, surfactants to keep all the ingredients well blended and preservatives to increase its shelf-life. \n\nOnce there is evidence to prove the efficacy of a vaccine, initial testing is done on animals whose DNA closely resembles humans, to try and develop an immune response. \n\n\n2. Testing \n\nOnce the animal testing yields good results the testing moves further onto human volunteers."},{"readtime":"4 min read","heading":"EV: Is India Ready?","author":"Ishaan Shetty","url":"https://www.finbitsindia.com/post/ev-is-india-ready","_id":"dfd40d0c-fd94-4ac2-a1f6-5d5c4ead9457","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T19:36:31.990Z","_updatedDate":"2021-06-02T19:36:31.990Z","date":"Dec 21, 2020","news":"India’s domestic automobile industry kick-started during the British Raj in 1942 when Hindustan Motors first introduced the 4-wheeler to Indian roads. However, the industry picked up pace only after the liberalization period in 1991. The Narasimha Rao government (in office 1991-1996) came down heavily on this sector and pushed for many changes such as the adoption of Compressed Natural Gas (CNG) in commercial & public transport vehicles across India, emission norms, and other similar legislations.\n\n\n\n\nBut the question before us is, even after 100+ years of Internal Combustion (IC) engines, are Electric Vehicles (EVs) here to stay? Are we ready for the tectonic shift? The brief answer is that electric vehicles are already here and demand for EVs and EV amenities will only skyrocket in the next decade.\n\n\nThe future of transportation is clean and sustainable. India is making significant strides towards a green mobility market and we will see clean alternatives on Indian roads shortly. According to a report by Economic Times, 90% of car owners in India are ready to switch to an EV, but this report does not factor in vehicle cost. The first EV car launched by Hyundai was “Kona”, costing 24 lakhs, Delhi Ex-showroom. At the same price, a person can buy 4 Maruti Suzuki’s Swift Desire, which is the best-selling car in India according to Statista. In a price-sensitive market such as India, EV manufacturers will have to overcome the obstacle of high costs involved in buying the green alternative.\n\n\n\n\nEVs will put the brakes on tailpipe emissions and also reduce India’s dependency on oil imports. Last year, NITI Aayog, which spearheads Narendra Modi’s EV initiative, proposed a ban on the production of 2 wheelers under 150cc by 2025 and 3 wheelers by 2023. This proposal became a pain point for the sector, which was already in hot water. Nitin Gadkari, Minister of Road Transport and Highways relaxed these norms after India Inc had vehemently lobbied against the government’s plan.\n\n\nThe union cabinet has approved the National Mission on Transformative Mobility and Battery Storage, which is thought of as a positive boost and aligns with the Modi Government’s vision for “Atmanirbhar Bharat”."},{"readtime":"5 min read","heading":"The Farmer, The Protest... and everything in between!","author":"Abhishek Doppalapudi","url":"https://www.finbitsindia.com/post/the-farmer-the-protest-and-everything-in-between","_id":"d194df34-f41a-4b22-9f67-23a2beea9f4f","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T19:33:25.884Z","_updatedDate":"2021-06-02T19:33:25.884Z","date":"Dec 14, 2020","news":"Twitter was recently set ablaze by the spat between actress Kangana Ranaut and singer-songwriter Diljit Dosanjh. The insults hurled at each other and frantic translations of Diljit’s tweets from Punjabi to other languages by netizens epitomized the polarized circumstances precipitated by the three farm bills the government passed in September 2020. The spat began with Kangana misidentifying a protesting woman farmer by labeling her as Bilkis Bano, who became famous during the anti-CAA protests earlier this year. She insinuated that the protest was politically motivated and that anti-establishment elements were influencing the protestors. Diljit responded by sharing a video clip of the woman farmer and tweeted that her name is Mahinder Kaur. The vitriolic spat that followed was a clash of two disparate narratives. A clash that began because of the government’s vision of “liberating” the farmers.\n\n\nSo, what exactly are these new farm bills about?\n\n\nThe government passed these farm laws in late September amidst vehement opposition, with many alleging that these bills were passed unconstitutionally. Even political parties that usually sided with the government opposed the bill. Two of the three bills were passed by voice vote amidst ruckus in the upper house. The president approved all three bills, and they became laws. They were projected as major reforms that would bring a much-needed change in the stagnant agricultural sector. These bills promised to remove middlemen and enable the farmers to sell anywhere in the country. \n\n\nSome salient points of these laws are:\n\nEnable the farmers to bypass the government regulated markets known as mandis and sell produce directly to private buyers, thus opening up the sector to private players. Till these bills came into effect, the first sale of produce could only occur at the mandis of the APMC (Agricultural Produce Marketing Committee). This bill allows them to sell outside these regulated markets. \n\n\nAllow the farmers to enter into contracts with agri-business firms or large retailers at pre-agreed prices of their produce. This practice is known as contract farming and will allow the farmers to sell across state borders. \n\n\nThese laws also remove the previous restrictions imposed on hoarding agricultural stock. This will allow traders and other players to stockpile produce."},{"readtime":"5 min read","heading":"Reverse logistics: Unnecessary Fad or Essential Component?","author":"Apoorv Verma","url":"https://www.finbitsindia.com/post/reverse-logistics-unnecessary-fad-or-essential-component","_id":"75c17b5b-2f56-4775-9dac-585b3d13dbba","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T19:30:43.624Z","_updatedDate":"2021-06-02T19:30:43.624Z","date":"Dec 7, 2020","news":"Reverse logistics would pretty much be the best words to throw around at a hot-shot business party if you were a mid-age entrepreneur. Mid-age, because almost all the current e-commerce millionaires/billionaires, who have streaks of grey in their hair would claim this term to have had a significant contribution to their rise to financial glory.\n\n\nYes, this term is quite a mouthful.\n\n\nAnd extremely omnipresent.\n\n\nChances are you may have very well triggered a reverse logistical cycle at least once in your lifetime. \n\n\nPicture those ‘hassle free-returns, no questions asked’ advertisements which Flipkart and Snapdeal keep on tossing around. That should be way easier to wrap your head around instead of the term ‘reverse logistics’.\n\n\nWhat this fancy concept stands for is trivially simple. Let’s get to it.\n\n\nImagine that you ordered a smartphone from an ecommerce giant like Amazon and you found out that the screen is cracked upon delivery. \n\n\nThen, unsurprisingly, you placed a complaint and within a couple of days a delivery executive rang up your door and collected the damaged smartphone, without drilling you with a million questions.\n\n\nIn essence your smartphone travelled back along its logistical path to the seller. \n\n\nThere you go. This should make things more digestible.\n\n\nWith the exponential rise of ecommerce giants like Amazon and Snapdeal, innovators stumbled across the scenario of a customer returning a product due to different factors like damages, low-quality, general dissatisfaction, or anything for that matter.\n\n\nIt isn’t difficult to deduce what happens next if this issue is not taken care of.\n\n\nThe customer then rambles around spreading ill-will regarding the company and its services, hurting business and profits. If not handled innovatively, it could lead to a permanent disfigurement of the company’s reputation. \n\n\nThat is one territory you certainly don’t want your company to be treading in.\n\n\nSo now let’s officially define the concept of Reverse Logistics."},{"readtime":"5 min read","heading":"15-minute cities: Redirecting Urban Planning","author":"Preet Ganatra","url":"https://www.finbitsindia.com/post/15-minute-cities-redirecting-urban-planning","_id":"592399cd-bb18-4384-84b2-a29c1191a002","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T19:28:26.685Z","_updatedDate":"2021-06-02T19:28:26.685Z","date":"Nov 30, 2020","news":"The COVID-19 pandemic has derailed urban economies all over the world. Governments, both at the local as well as state level, are toiling for economic recovery as countless small businesses have abandoned hope, local taxes have fallen short and the unemployment rate has surged like never before. Every individual has been introduced to unaccustomed norms of social distancing, working-from-home and supporting local businesses.\n\n\nIn addition to this, concerns of air pollution, resource depletion, global warming and climate change are not new to the urban population. Now, as we stand at the threshold of recovery, it is pertinent to rebuild our cities sustainably, thus making them resilient to deal with future economic and social fall-outs.\n\n\nAgainst this backdrop, an international coalition of urban leaders, called the C40 cities Climate Leadership Group, proposed for the implementation of a ‘15-minute city’ idea. The idea recently gained momentum when the mayor of Paris, Anne Hidalgo propagated it as the centerpiece of his re-election campaign. The concept was developed by Prof. Carlos Monero, with a vision to transform Paris. It then received widespread consideration by mayors of various cities across the globe and opportunely became a part of the ‘C40 Mayors’ Agenda for Green and Just Recovery in the wake of Covid-19.’\n\n\nWhat does the idea of a 15-minute city stand for?\n\n\nA ‘15-minute city’ is a creative idea in the urban planning domain, which aims at creation of hyper-proximity infrastructure, i.e, developing or re-building the city in a way, such that residents can gain access to all their needs - retail, work and leisure, within a 15-minute walking or cycling radius of their homes."},{"readtime":"5 min read","heading":"What the nation should know....","author":"Khooshmin Mirza","url":"https://www.finbitsindia.com/post/what-the-nation-should-know","_id":"7dbe07c3-a551-490b-8a19-873e5e05c1c3","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T16:50:37.104Z","_updatedDate":"2021-06-02T17:00:46.330Z","date":"Nov 23, 2020","news":"'A news sense is really a sense of what is important, what is vital, what has colour and life- what PEOPLE are interested in. That’s journalism.’ - Burton Rascoe.\n\nThe institution of journalism and news media is considered the ‘fourth pillar’ of a democracy, its importance and strength well recognized by the Indian Constitution. Media not only forms a medium of expression of feelings, opinions and views but also is instrumental in cultivating opinions and views on matters of regional, national and international importance. News media and journalism is considered significant in shaping and maintaining a democracy while mobilizing the thinking process of people. The dissemination of news must remain impartial and free of any control or alteration, irrespective of the medium used.\n\nMedia- the fourth pillar of Democracy \n\nIndian history is evidence to this fact- newspapers and journals formed the backbone for all mass movements and popular upsurges, lent a voice to the Indian freedom struggle and played a crucial role in the ‘making of India’ post-independence. "},{"readtime":"4 min read","heading":"Tinsel Town Toppled","author":"Tanvi Bhamare","url":"https://www.finbitsindia.com/post/tinsel-town-toppled","_id":"f78fcaf9-70b9-40b5-b96e-65a432ae97cf","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T16:48:43.919Z","_updatedDate":"2021-06-02T17:01:13.840Z","date":"Nov 16, 2020","news":"Bollywood, formerly known as Bombay cinema, is the Indian Hindi-language film industry based in Mumbai (formerly Bombay). The term is a portmanteau of Bombay and Hollywood. One can trace its roots back to the late 1890s, the initiation point of this behemoth industry.\n\nHindi Cinema that we know of was not always so gargantuan and glamorous. It has a chequered past and has seen its fair share of dull moments. Although modern Bollywood began in 1931 with India’s first sound film Alam Ara, the Great Depression suppressed the industry for almost two decades. After a dull phase marked by the depression, Bollywood entered its so-called golden age auspiciously at the time when India gained its independence from the British. Filmmakers were now burning with patriotism and passion to build their film industry by taking over the reins of Cinema. They produced some of the most critically acclaimed films of all time during this era."},{"readtime":"3 min read","heading":"Battle against the Internet","author":"Abhishek Doppalapudi","url":"https://www.finbitsindia.com/post/battle-against-the-internet","_id":"cb7568bd-bab3-4fef-83b6-dfe57504f33c","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T16:46:51.315Z","_updatedDate":"2021-06-02T17:02:10.046Z","date":"Nov 9, 2020","news":"The Analogy;\n\nImagine you walk into a store to buy essentials. When you enter the store, you notice that they place the products offered by a major brand in prime locations, easily accessible to you. Knowing the quality and the relative ease of access, you load those products into your shopping cart without looking for any alternatives.\n\nNow imagine every single retail store in the world stocks its products in the same manner. Every single outlet places the products by this major brand right in front of the store and makes it difficult or unattractive for you to look for other alternatives. Why and how you ask? Well, it is a behemoth earning colossal amounts of revenue. It pumps that money back into ensuring that its products dominate the shelves in the store.\n\nDepartment of Justice Headquarters, USA\n\nThe Case against Google : Search engine or Market Bully?"},{"readtime":"5 min read","heading":"Right v/s Left","author":"Dhruv Chincholikar","url":"https://www.finbitsindia.com/post/right-v-s-left","_id":"dae03222-ad5e-43fc-90c4-710e0dde301b","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T16:45:27.111Z","_updatedDate":"2021-06-02T17:02:26.951Z","date":"Nov 2, 2020","news":"The United States of America faces its most exciting, decisive and probably divisive election as it gears up to elect its 46th President on November 3rd. The world’s most powerful country will choose been incumbent Republican President Donald John Trump and Democratic nominee and Barack Obama’s Vice President Joseph Robinette Biden. Let’s dive in. \n\nHow does the political system in the USA work?\n\nThe basic system of politics is similar yet different to ours. It has a two-party system, namely the Conservative ‘Republicans’ and the Liberal ‘Democrats.’ The executive is run by the President and his Cabinet, while the legislature is an independent entity."},{"readtime":"6 min read","heading":"Getting Smart With Investments","author":"Preet Ganatra","url":"https://www.finbitsindia.com/post/getting-smart-with-investments","_id":"83942d20-dd45-4274-9cc1-0fdac4840229","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T16:42:07.977Z","_updatedDate":"2021-06-02T17:02:39.614Z","date":"Oct 26, 2020","news":"Ever wondered how wealthy you would be at this minute, if the money that you saved in your modest piggy bank, as a child, compounded itself every year, till you turn 21? The best gift any young adult could possibly give to their future self is a sizeable portfolio that has exponentially grown over the years; thus providing financial independence in the years of retirement. \n\nCertainly, it’s easier said than done. The crucial question here being, is saving money enough to become financially independent in the long run? The answer is clearly No. ‘Investing’ your money, and not just ‘saving’ it, will assist you in achieving your financial goals. But duhh, isn’t it the same thing?"},{"readtime":"3 min read","heading":"Infosys: From 10K to 5 Lakh Crore!","author":"Husain Ghadiali","url":"https://www.finbitsindia.com/post/infosys-from-10k-to-5-lakh-crore","_id":"3f882e68-2b0e-4af1-bbf9-a60f93a49b9c","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T16:40:14.870Z","_updatedDate":"2021-06-02T17:02:52.655Z","date":"Oct 19, 2020","news":"It’s the year 1981. Telephones are considered as a luxury, and there’s a telephone waiting list of approximately 20 million. Liberalization has not yet hit India, and it is immensely difficult to start a business in times like these. \n\nForeign exchange reserves have reduced to a point where India can barely finance three weeks’ worth of imports. The government is in strong favor of closing India off to the outside world. The Indian rupee is inconvertible to other currencies and high tariffs and import licensing are preventing foreign goods from entering the Indian market. In the I. T sector, demand for customized software computing for companies is on the rise."},{"readtime":"5 min read","heading":"Ardern’s Archduke-ship","author":"Dhruv Chincholikar","url":"https://www.finbitsindia.com/post/ardern-s-archduke-ship","_id":"5b88d559-d589-4b68-9d68-39f682647038","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T15:13:18.561Z","_updatedDate":"2021-06-02T17:03:09.952Z","date":"Oct 12, 2020","news":"A country with more sheep than people, touted as the land of the Kiwi, New Zealand, has had a rich and diverse political history. By becoming the first nation in the world to give women the right to vote all the way back in 1893, New Zealand cemented itself as paragon for including women in a predominantly patriarchal political system. The current Prime Minister, Jacinta Ardern is one of the very few female leaders of a country, stupefying the world when she first took office aged 37 in 2017. With elections around the corner, let’s dwell into her chances of being re-elected.\n\nArdern joined the Labour Party aged 17 and has been unstoppable ever since. From becoming a senior member in the ‘Youth Labour’ sector of the party, to being unanimously elected the leader of the Labour Party, her journey has been sensational. In 2017 after a hung parliament ensued, the Labour Party, New Zealand First and Greens formed a coalition with Ardern as the next Prime Minister. And the rest is history…"},{"readtime":"4 min read","heading":"Binge Watching on Netflix? Here’s why.","author":"Ishaan Shetty","url":"https://www.finbitsindia.com/post/binge-watching-on-netflix-here-s-why","_id":"36e18b6e-46c4-4d3b-ae99-c647315cb85a","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T15:10:35.954Z","_updatedDate":"2021-06-02T17:03:40.980Z","date":"Oct 5, 2020","news":"Could you “BE ANYMORE ADDICTED TO NETFLIX?”  An industry that has rapidly surpassed cable subscriptions and now stands at 613 million subscribers, permanently altering the market dynamics and changing the way we consume content.\n\nAmidst ubiquitous piracy, full-length movies, and television episodes at throwaway prices on cable TV, Netflix’s nascent efforts to break into the Indian market were launched in January 2016. Netflix introduced it months before Reliance Jio entered the market and started offering high-speed internet at lucrative prices, which provided the perfect launchpad for the over the top platform."},{"readtime":"4 min read","heading":"Cleared to Land… Into Bankruptcy","author":"Dhruv Chinchoikar","url":"https://www.finbitsindia.com/post/cleared-to-land-into-bankruptcy","_id":"32ab88dd-b057-4375-82e3-e2054bdba7de","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T15:07:57.201Z","_updatedDate":"2021-06-02T17:04:03.085Z","date":"Sep 21, 2020","news":"Jet Airways, Kingfisher Airlines...what do they both have in common? (Apart from the giant aircrafts and scrumptious treats!) These were airlines that once dotted Indian skies, but now their memory dots our hearts. In-fact over the last 21 years 12 airlines have gone under in India. Even when India is poised to become the third largest aviation market by 2025, why do they keep going under? Not to mention, the robust expectation of year on year growth of passenger demand by 20%. So there’s a demand that the supply can’t keep up with. Yet the supply is dwindling!\n\nRunning an airline has costs, envisioning which is difficult to say the least - the paper they print boarding cards on, the tarps keeping everyone in an orderly line, the crew, the aircraft, the parking bay and so much more. "},{"readtime":"4 min read","heading":"Reality of REITs","author":"Hriday Vora","url":"https://www.finbitsindia.com/post/reality-of-reits","_id":"3e54205f-5fce-4869-b350-4b893f90b684","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T14:55:27.893Z","_updatedDate":"2021-06-02T17:04:33.860Z","date":"Sep 14, 2020","news":"Real estate as an asset class has always attracted investors, but the high-ticket size has made it out of reach for many. \n\nClaim: Today, in India, you can invest in commercial real estate by shelling out as low as Rs 55,000. Sounds dubious? Well, SEBI has made sure that the claim isn’t dubious. \n\nBut how do you invest in commercial real estate with an amount as low as Rs 55,000?\n\nThe answer is a Real Estate Investment Trust (REIT).\n"},{"readtime":"7 min read","heading":"The ever-changing face of the Hagia Sophia","author":"Khooshmin Mirza","url":"https://www.finbitsindia.com/post/the-ever-changing-face-of-the-hagia-sophia","_id":"ae65aa92-17f5-416d-8b6a-97745a44b34d","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T14:53:45.154Z","_updatedDate":"2021-06-02T17:04:55.072Z","date":"Sep 7, 2020","news":"Istanbul, Turkey, as Susan Moody identifies, is the ‘constant beating of the wave of the East against the rock of the West.’ \n\nA perfect blend of tradition and contemporary, Istanbul offers a constant time travel between the past, present and future, owing to its capricious history and concomitant architecture. It is often referred to as the ‘harmony of opposites’ and true to this apophthegm, there lies a quaint edifice, an architectural marvel, dominating the city’s skyline with a saga that transcends all borders-\nThe Hagia Sophia (literally meaning ‘Holy Wisdom’). \nThe Hagia Sophia, Istanbul, Turkey"},{"readtime":"5 min read","heading":"Gold Rush: Gliterry or Jittery?","author":"Preet Ganatra","url":"https://www.finbitsindia.com/post/gold-rush-gliterry-or-jittery","_id":"a933323f-413a-4598-9535-62398f44ba1c","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T14:51:50.098Z","_updatedDate":"2021-06-02T17:05:18.245Z","date":"Aug 31, 2020","news":"Gold is an ageless precious metal that has an emotional, financial and cultural value, not just in India, but globally. \n\nThe metal finds its application in jewellery, technology, and by central banks as well as investors, which leads to the formation of various sectors within the gold market. These sectors rise to prominence at different points in the global economic cycle. \n\nThe gold market therefore, is extremely diverse and growing. However, the supply of gold has changed very little over time; increasing by hardly 1.6% annually, over the past 20 years. "},{"readtime":"4 min read","heading":"Dmart = DiscountMart?","author":"Husain Ghadiali","url":"https://www.finbitsindia.com/post/dmart-discountmart","_id":"5f816ea2-9c45-41d3-9e10-757da337c177","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T14:50:05.473Z","_updatedDate":"2021-06-02T17:05:32.782Z","date":"Aug 24, 2020","news":"The one name that almost inevitably comes up when talking about the stock market is Rakesh Jhunjhunwala, the stalwart of the stock market who has made his fortunes trading, and for good reason. His acumen and trading insights have been admired by many. But only some know of who this tycoon considers his mentor to be.\n\nYou're sure to have gone grocery shopping or ordered online in this lockdown. You may not have shopped at or ordered from D-Mart but you couldn't possibly not have heard of it.\n\nThis new chain of supply stores may not overtly raise curiosity, but it masks an elaborate and well thought of business idea that can potentially outperform the long-time contenders in this game. The brain-child of one man."},{"readtime":"4 min read","heading":"The American Dream has been put on hold","author":"Ishita Agarwal","url":"https://www.finbitsindia.com/post/the-american-dream-has-been-put-on-hold","_id":"1a3c3c71-39dd-4bac-bdde-6f783916869e","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T14:48:12.763Z","_updatedDate":"2021-06-02T17:05:49.141Z","date":"Aug 17, 2020","news":"The COVID-19 pandemic has impacted college students across the world as all the classes suddenly got shifted to being on zoom, resulting in us yelling out “MUTE YOURSELF” every so often during our classes. \n\nThe unfavourable side of online instruction has got every college student waiting for their universities to announce final plans for the reopening of their campuses for Fall 2020. Clinging to the sliver of hope, that their lives might be able to return to normal, once their classes start back up.\n\nHowever, it seems for international students staying in the US, the Immigration Customs and Enforcement agency (ICE) had different plans as they released new guidelines on the 6th of July, 2020."},{"readtime":"6 min read","heading":"Congress: A Hub of Rebellions?","author":"Ishaan Shetty","url":"https://www.finbitsindia.com/post/rebel-politics-in-congress","_id":"a3ac04eb-8121-4ffc-8a13-7b8b6d9f04d0","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T14:46:19.489Z","_updatedDate":"2021-06-02T17:06:00.176Z","date":"Aug 10, 2020","news":"“Congress is the country, and the country is Congress”, declared Pandit Jawaharlal Nehru (1889-1964), Indian National Congress (INC) president. This is a striking remark to make for a political party in a democratic nation. INC is one of the oldest political parties to be formed in India and was founded long before the communist parties.\n\nCongress party has been in shambles ever since Rahul Gandhi (MP from Wayanad, Kerala) officially resigned from the post of party president on 3rd July 2019. Many critics claim that the party cannot survive without the Gandhis. Well, those who make this claim seem to have forgotten the history of Congress. The Indian National Congress is over 130 years old, much older than the Gandhis or the Nehrus. Congress came into existence much before the Gandhis and doesn’t need Sonia Gandhi or Rahul Gandhi for its survival now."},{"readtime":"6 min read","heading":"JioMeet: Original Work or Colourable Imitation?","author":"Khooshmin Mirza","url":"https://www.finbitsindia.com/post/jiomeet-original-work-or-colourable-imitation","_id":"57aa8728-ada6-42df-8ef6-8a95832b3856","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T14:44:10.192Z","_updatedDate":"2021-06-02T17:06:46.691Z","date":"Aug 3, 2020","news":"‘Go Digital’, a phrase that today, is almost germane to businesses has been transformed into a juggernaut by the name of Jio Platforms. The wholly owned subsidiary of Reliance Industries Ltd., India’s behemoth group of industries, has become the face of digital India. In 2019, Reliance Jio along with the company’s various digital ventures were clubbed under one ‘Jio Platforms’. Since then Jio has added a myriad of products and services under its banner, centered around 4G services, home broadband, entertainment, social connectivity, news and utility. \n\nWith the world reeling with Covid-19, the demand for operator services has spiked, thereby offering fecund opportunities for Jio Platforms to announce a series of investments cum partnerships from technology giants namely Facebook, Google and Intel, and investors such as Silver Lake, KKR, Vista among many."},{"readtime":"6 min read","heading":"Breaking Bad","author":"Hriday Vora","url":"https://www.finbitsindia.com/post/breaking-bad","_id":"46eaa5a9-cdc2-48c4-a427-4ffdd4d0d2bf","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T14:40:24.669Z","_updatedDate":"2021-06-02T17:07:18.720Z","date":"Jul 27, 2020","news":"NPA SITUATION:\n\nThe burning question – What is NPA?\n\nAn asset with a bank becomes a non-performing asset (NPA) if, as per the current RBI regulations, interest and/or principal on a loan remains unpaid for 90 days. Depending upon the nature of the security available / recoverability, banks are required to make provisions for these NPAs ranging from 15 to 100%. \n\nThe sharp increase in NPAs over the years can be largely attributed to (1) A sustained economic slowdown for over a decade now (2) Unscrupulous lending by banks & Financial Institutions without proper assessment of actual funding requirements and its end use (3) Lack of monitoring (4) Somewhat ineffective legal system & insolvency process. This has resulted in the evaporation of lakhs of crores of public money over a period of time. The graph below gives an idea of the growing NPA menace in the Indian Banking System."},{"readtime":"5 min read","heading":"The Game of Memes","author":"Preet Ganatra","url":"https://www.finbitsindia.com/post/the-game-of-memes","_id":"18473b58-81f8-4b10-be98-4e3bf9ddd097","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T14:38:14.926Z","_updatedDate":"2021-06-02T17:07:30.825Z","date":"Jul 20, 2020","news":"‘The science of humor is no joke!: A statement that you will be convinced with, at the end of this article!\n\nA study conducted by the management at the Australian National University concluded that short exposure to humorous stimuli improves the perseverance of people in completing tedious tasks. The group under study, watching humorous content, completed their task in almost half the time as against the other group, watching positive motivational content! Surprising isn’t it?\n\nVarious researchers have also concluded that humor not only provides a ‘mental-break’ but also boosts the immune system and helps to recover from stressful situations. This pretty much explains the essential human need for fun and laughter; and what is a better source of humorous content than the internet itself?"},{"readtime":"5 min read","heading":"Wirecard: The story of the missing €2 Billion","author":"Abhishek Doppalapudi","url":"https://www.finbitsindia.com/post/wirecard-the-story-of-the-missing-2-billion","_id":"48ae7a0d-8a23-4410-be42-b412c86bf9f8","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T14:33:29.556Z","_updatedDate":"2021-06-02T17:07:47.363Z","date":"Jul 13, 2020","news":"On the 18th of June, 2020, an announcement was made by Ernst & Young (EY) Germany, the auditor for Wirecard, that sent shock-waves of gargantuan proportions throughout the financial world. \n\nMind you, the proclamation was made right in the middle of the COVID - 19 crisis, with daily cases rising across Europe and the financial markets already tumbling due to the precipitated circumstances. \n\nThe auditor announced that it could not sign off on the balance sheets because a \"black hole\" was detected in them. They were unable to locate close to 2 Billion Euros (169,898,000,000 INR :) ) cash that the company had reported. The amount represented nearly 25% of the balance sheet total and it seemed to have vanished into thin air!"},{"readtime":"4 min read","heading":"Utterly Butterly Marketing Strategy of Amul","author":"Ishaan Shetty","url":"https://www.finbitsindia.com/post/utterly-butterly-marketing-strategy-of-amul","_id":"21442554-53cc-4046-8569-6e3884d71809","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T14:31:18.492Z","_updatedDate":"2021-06-02T17:08:02.644Z","date":"Jul 6, 2020","news":"Ever heard this tagline “ Utterly Butterly Delicious”, sure you have!\n\nOver the past years, the taste of India, Anand Milk Union Limited (AMUL), became the most beloved brand of India. Every Indian has grown up hearing the jingles of its many dairy products, and the Amul girl, the cheerful blue-haired brand mascot in a red polka-dotted dress has wowed to give amusing one-liners on billboards and print ads. Amul has made a lot of progress since its founding in 1946.\n\nBIRTH OF AMUL\n\nIn 1942, a union was formed in Kaira District, which started pasteurising milk produced by farmers and sold it to Bombay Milk Scheme. When this trade grew, they set up a plant and Dr Verghese Kurien, rightly called as the Milkman of India, helped spur the White Revolution, the largest dairy development strategy in the world. Dr Kurien wanted to provide small-scale farmers, quality-control factories and a marketing hub, which weren’t there in those days. Thus, in 1973, the Gujarat Cooperative Milk Marketing Federation (GCMMF) was founded, which helped in the marketing of dairy products. Amul comes under GCMMF."},{"readtime":"5 min read","heading":"TikTok: A Dark Horse?","author":"Preet Ganatra","url":"https://www.finbitsindia.com/post/tiktok-a-dark-horse","_id":"3cd3900d-4d08-4cff-964f-b552eda9ec66","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T14:28:28.129Z","_updatedDate":"2021-06-02T17:08:32.387Z","date":"Jun 29, 2020","news":"As per the report released by SensorTower, TikTok was the most-downloaded non-game application worldwide for May 2020 (having about 112 million downloads), with 20% of installs attributing from India.\n\nAs implausible as it sounds, this application was introduced no longer ago than 4-years, in 2016 and has today become the most sensational app globally, overtaking giants like Whatsapp, Facebook, Youtube, Netflix and Snapchat. \n\nWhat makes TikTok such a whopping success? Do our young entrepreneurs have something to learn from its strategy? Let’s find out!\n\nThe impetus to this blistering growth of TikTok was undoubtedly given by the mastermind, Zhang Yiming, the founder of ByteDance, parent-company of TikTok."},{"readtime":"5 min read","heading":"Sneak(er) Peak Into Vans","author":"Husain Ghadiali","url":"https://www.finbitsindia.com/post/sneak-er-peak-into-vans","_id":"b9fa163a-ec64-433f-a680-8f28ba6a7060","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T14:25:13.509Z","_updatedDate":"2021-06-02T17:09:04.409Z","date":"Jun 22, 2020","news":"What does this picture remind you of?\nChess? A race flag?\n\nWell, aside from these, this design also served another important purpose.\n\nIt became the reason for Vans to become among the leading brands for shoes.\n\nSo how did this design help Vans?\n\nHere’s how:\n\nThese pair of shoes went on to become the most iconic pair of shoes by Vans and are available for sale even to this date."},{"readtime":"6 min read","heading":"Hindi-Chini No Buy-Buy","author":"Hriday Vora","url":"https://www.finbitsindia.com/post/hindi-chini-no-buy-buy","_id":"fa7229d2-39cc-4762-8194-e6b94d3182ab","_owner":"a02be2dd-3ce6-464c-8a91-5394e89691fb","_createdDate":"2021-06-02T14:17:35.435Z","_updatedDate":"2021-06-02T17:09:13.616Z","date":"Jun 19, 2020","news":"Tired of reading everywhere that India is not at a stage where it can boycott Chinese products? Here is a contrarian view! \n\nA lot of focus here has been on why we buy the Chinese products, how they have been able to sell their products at such low prices consistently over the years, and what India in its current capacity can do to surpass China as the Globe’s largest manufacturing hub, of course over a period of time. But the prerequisite here is – every citizen necessarily has to believe – “COUNTRYMEN WILL DO WELL ONLY IF THE COUNTRY DOES WELL ”"}]
