[
  {
    "author":"Khooshmin Mirza",
    "date": "Mon, Mar 8",
    "readtime":"6 min read",
    "img": "https://images.unsplash.com/photo-1501103777042-0aeb4df8ff8f?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxwaG90by1yZWxhdGVkfDE3fHx8ZW58MHx8fA%3D%3D&auto=format&fit=crop&w=800&q=60",
    "heading": "IT. More than just a movie…",
    "news":"On 25th February, 2021, the Centre notified the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (‘2021 Rules’) under S.87 of the Information Technology Act, 2000. \n\nThe primary objective behind framing the said rules:\n\na) To strengthen grievance redressal mechanisms and, \n\nb) To have a ‘soft-touch’ oversight mechanism in relation to social media, digital media and OTT platforms. \n\nIndia’s growing online presence has given a platform to its citizens from all income backgrounds to share their opinions, seek information and become a part of this burgeoning virtual world that leaves no voice unheard. However, certain ‘virtual evils’ by the name of fake news, morphed images, obscene content, etc. have fomented an environment of disharmony and violence, which prompted corrective measures from the Government. \n\nCountdown to the 2021 Rules…\n\n3… Therefore the Ministry of Electronics and Information Technology (MEITY) framed a draft Information Technology (Intermediary Guidelines) Rules, 2018, thereby proposing an amendment to the previously existing Information Technology (Intermediary Guidelines) Rules, 2011 (‘2011 Rules’). \n\n\n2… The said draft rules were then released in the public domain in December 2018, inviting comments and/or counter-comments from relevant stakeholders of the public. \n\n1… Further, there has been a significant spike in digital media consumption, with people opting for OTT platforms (added boost due to Covid-19). Lack of content regulation on OTT platforms and its resultant complaints pushed the need for an oversight mechanism.\n\n0… After relevant analysis of the public comments so received and the issues surrounding OTT platforms, the central government notified the 2021 Rules on February 25th, 2021. These now issued rules are an amendment to the 2011 Rules with their roots set in the 2018 draft IT Rules.\n\nWhat’s in the 2021 Rules?\n\n1. REGUATION OF SOCIAL MEDIA ITERMEDIARIES\n\n o   Two categories of Intermediaries\n\nIntermediaries with over 50 lakh (5 million) users now fall under Significant Social Media Intermediaries (SSMI) while the rest come under Social Media Intermediaries (SMI). \n\nThe purpose of this distinction is to determine which regulations are applicable to different social media platforms. \n\n2. REGULATION OF DIGITAL NEWS MEDIA AND OTT PLATFORMS\n\n \n\no   Code of Ethics:\n\nOTT Platforms\ni. Self-classification of content:\nOTT platforms (publishers of online curated content), are required to self-classify their content into five categories- U, U/A 7+, U/A 13+, U/A 16+ and A.\n\nii. Parental Locks:\nOTT platforms must implement parental locks for content classified as U/A 13+ and/or higher. Also, relevant age verification mechanisms are required for content classified as A. \n\nii. Display Rating:\nOTT platforms shall display, for every content so published, their respective classification rating along with a content descriptor that informs and advises the user about the nature of the content. \n\n\no   Digital News Media Platforms:\n\nDigital news media publishers are required to observe the norms of the Journalistic Conduct of the Press Council of India and the Programme Code under the Cable Television Networks Regulation Act, 1955. \n\nThis provision has been incorporated in order to ensure a level playing field between offline (Print and TV) and digital media.\n\no   Grievance Redressal Mechanism:\n\nThe 2021 Rules specify a three-tier grievance mechanism to ensure that digital news media and OTT platforms adhere to the above-mentioned Code of Ethics. \ni. Tier-1: Self-regulation by Publisher\nBoth digital news media and online curated content publishers are required to appoint a Grievance Officer residing in India. The officer is required to take a decision on every grievance within 15 days. Incase the complainant fails to receive a satisfactory response from the same, he/she may appeal to Tier-2.\n\nii. Tier-2: Self-Regulatory Body\nDigital news media and online curated content publishers are required to set up an in independent self-regulating body, registered with the MIB. This body will oversee adherence of the said publishers to the Code of Ethics as well as address grievances coming from tier-1. It is also empowered to issue guidance and/or advisories to the publishers, issue warnings and even censor content. \n\niii. Tier-3: Oversight Mechanism\nThe oversight mechanism is an inter-departmental committee consisting of members from the MIB, Ministry of Women and Child Development, Ministry of Law and Justice, MEITY, etc. chaired by joint secretary of the MIB. This committee is responsible for hearing complaints in relations to decisions taken at tier-1 and tier-2 while empowered with the authority to delete or modify content to prevent any instigation that leads to disruption of public order. \n\n\t\n\nWithin days of their release, the 2021 Rules find themselves in the midst of a fracas with those claiming them to being an attack on the freedom of speech and expression, an invasion to online privacy and an impetus to ‘surveillance culture;’ whereas those in favour, that it is a complete answer to weed out elements in the society who are anti-national and also those circulating fake news on social media with a view to insight disharmony and to destabilize the government.\n\n\nIt is therefore left to you readers whether the proposed amendments to the 2011 Rules is a boon or a bane to online India. \n\n\no   Due Diligence to be followed \n\nAll intermediaries are required to comply with the 2021 Rules. For example, all intermediaries are required to publish the rules and regulations, privacy policy and user agreement on their website and/or application, etc.\n\nFailure to comply with the same shall prevent the ‘safe harbour’ provisions contained in S.79 of the Information Technology Act, 2000 from protecting them.\n\nThe given due diligence provisions are an addition to the ones mentioned in the 2011 Rules, an attempt to tackle the circulation of fake news and obscene material. \n\n\no   Mandatory Grievance Redressal Mechanism\n\nAll intermediaries are required to appoint a Grievance Officer to deal with complaints, with his/her name and contact details shared.\n\nThe officer is required to acknowledge the complaint(s) within 24 hours and resolve the same within 15 days of receiving such complaint(s). \n\nThis amends the said provision as mentioned in the 2011 Rules by reducing the time period of receipt and resolve of complaints from one month to 24 hours and 15 days respectively. \n\n\no   Ensuring online safety and dignity of users\n\nAll intermediaries shall remove or disable access, within 24 hours of receipt of a complaint, of contents that expose the private areas of individuals, show such individuals in partial or complete nudity, morphed images, etc. \n\nThe said complaint can be filed by an individual or a person on his/her behalf.\n\nThis provision has been incorporated to tackle the problem of publication of nudity/sexual content without consent. \n\n\no   Takedown of Unlawful Information \n\nAll intermediaries, upon receiving actual knowledge by way of a court order or by being notified by a government agency shall take down any information that is prohibited by law, in the interest of sovereignty and integrity of India, friendly relations with foreign states, public order, contempt of court, decency and morality, etc. \n\nSuch information shall be removed within 36 hours from receipt of actual knowledge by the intermediary.\n\nThis provision has been drafted in response to the growing objectionable and politically-coloured content that has been doing rounds on several social media platforms. \n\n\no   Mandatory Data Retention \n\nAll intermediaries are required to preserve information for a period of 180 days for investigative purposes, even after the user has deleted his/her account.\n\n\no  Additional due diligence provisions for Significant Social Media Intermediaries (SSMI)\n\n\nAppointment of three officers who must reside in India:\n(i) Chief Compliance Officer, who is responsible for ensuring compliance with the Information Technology Act, 2000.\n(ii) Nodal Contact Person, for 24*7 coordination with law enforcement agencies.\n(iii) Resident Grievance Officer, with responsibilities like those of the Grievance Officer for SMIs. \n\n\nCompliance Reports: SSMIs are required to publish compliance reports containing details of the complaints that were received and the action taken on the same. It must also contain details of the content removed by the intermediary proactively. \n\n\nTracing the originator of the message: \n(i) SSMIs primarily in the nature of messaging, are needed to enable tracing of the ‘originator of the information.’\n(ii) This provision does not require the intermediaries to reveal any other information related to the originator of the information or any information related to other users. \n(iii) This provision was incorporated for the purpose of curbing the nuisance of fake news and obscene content.\n\n\nAutomated Filtering: \n(i) SSMIs are required to develop and deploy technology-based measures to proactively identify any information that depicts an act or simulation depicting rape, child sexual abuse or misconduct. \n(ii) The intermediary is required to give a notice to any user trying to access such information.\n\n\nVoluntary Verification of Users: Users must be allowed to voluntary verify their accounts using appropriate mechanisms, which includes using the Indian mobile number of the user. Also, the said user’s account must display a verification mark. \n\n"
  },
  {
    "author":"Apoorv Verma",
    "date": "Mon, Mar 22",
    "readtime":"6 min read",
    "img": "https://images.unsplash.com/photo-1569171206684-dfb2749d96fd?ixid=MXwxMjA3fDB8MHxwaG90by1yZWxhdGVkfDEyfHx8ZW58MHx8fA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=800&q=60",
    "heading": "How Augmented Reality will completely morph the automotive industry?",
    "news": "Remember that friend of yours who is a Pokémon-Go fanatic and also dreams of incorporating the same technology while building the next Gigafactory? You are going to regret dismissing him, and his idea after reading this article. The technology which I am referring to is ‘Augmented Reality’. \nIt honestly is just a fancy-pants term for a relatively intuitive concept. You just superimpose digitally created 3-D imagery on everyday objects and utilities, and that too in real time. You are then able to ‘augment’ the tangible ‘reality’ by incorporating digitally produced attachments onto it; Hence, the term Augmented Reality. The short-form for it is AR, unsurprisingly. \nNow the basic requirement for letting the below ideas assimilate in your head has been met with, how does AR make any relation with the dream of that friend of yours? \n\nThe ideas which are presented below are arranged to accommodate an ocean-like flow, ranging from how AR is useful in manufacturing a vehicle to how your driving skills will improve in quantum leaps, and how AR will eventually be able to save these puny lives of ours. Also, you will eventually realize that you have been living under a rock in a world which is slowly edging closer to developing a Jarvis, for every vehicle out there.\n\n\nFirstly, let us realize how AR will exponentially increase the efficiency and reduce the time required to manufacture vehicles.\n\n\nImagine being an automobile-designer for a moment. You are sitting with your compatriots and brainstorming over new designs, and you get struck by a one-in-a-million idea, right out of the blue. But now you’ve got to make a clay model of it, depicting every edge of that design of yours, and in the process, you lose track of how the chassis will beautifully converge into the rear bumper. I am serious here, clay-modelling is heavily used in brainstorming and finalizing designs.\nNow only if you were a designer in Ford, you would’ve been using Microsoft’s HoloLens, a holographic wireless headgear, with a built-in computer, which assists you in churning out designs and introduce changes to it. Now, you can stand around a basic skeleton of the car, which is made out of clay, with your designing team, while wearing these AR headsets. All of you will be connected to each other through the cloud, and will be able to incorporate changes onto that currently bland clay model, all that in real-time! Are the side-skirts too short? Just zoom-out with your fingers to elongate them. You’ll be able to incorporate changes with just a flick of your fingers and by waving your hands around!\nBut don’t get too jumpy at this prospect. Ford says that the clay-models are here to stay and the HoloLens will only be used where it can deliver concrete benefits, like in integrating those pesky engineering requirements, which will eventually ease down the work of all departments in the long run.\nNow that you are done with the designing, let us move on to the assembly line. The basic chassis has been assembled by your automated friends down the corner, and the job which requires surgical precision is yours to do, which involves manual fitting of quintessential equipment. Now if you were to run into a rut, you will have no choice but to seek help from the technical leads which will halt production and leadingly waste industrial time.\n\nThe above wouldn’t have been a problem if you had RealWear’s HMT-1Z1 AR enabled headset. RealWear has developed headsets that incorporate all the hardware components to a pair of glasses attached to a helmet. The AR glasses resemble those safety helmets used in constructions sites while drawing some hints from Google Glass.\n\nThe concept behind the HMT-1Z1 is to enable the assembly line personnel with digital data from manuals and streaming tutorial clippings so that they won’t have problems in troubleshooting control systems. \nFor the geeks who wish to know the specs, here you go: At the heart of the HMT-1Z1’s system architecture is a 2.0 GHz, 8-core Qualcomm Snapdragon processor, included with the 14-nm Adreno 506 Graphics Processor Unit (GPU) for supporting high definition 1080p multimedia. The headset possesses four microphones which actively cancel disturbances and also have a voice recognition feature. Now assembly-line workers can easily transmit images of the issue at hand to the technical supervisors, thereby enabling them to suggest counter-measures by superimposing images and other projections of various equipment, all that in real time, and the issue at hand will be dealt with right then and there, saving invaluable industrial time.\nNow, comes the universally dreaded aspect of the AR business, that is selling your brain-child, or your AR-child to the customers. The use of AR in here is surely questionable, but honestly, the way in which brands have exploited AR in this sector is truly ingenious.\nAudi recently launched Audi City, in London, which happens to be the world’s first fully digitalized car-showroom, by intensively applying the recent developments in AR. In here, you will be able to fully customize your dream-ride! By waving your hands around the car, you can have a look at every nook and corner of your car and just by flicking your fingers around, you’ll be running through all the colour-variants available for it. It eerily resembles the interface of racing games like NFS and Asphalt.\nRaju Sailopal, the Head of Sales at Audi City, London, claims that customers will also be able to hear how the engine of their ride sounds. Just the idea of being able to listen to your ride purring(virtually) should be giving all the grease-monkeys out there the wildest goosebumps!\nBut just when you thought that it can’t get any better, Hyundai, Jeep, and Volvo have recently begun to leverage AR insightfully, by creating digital showrooms which effectively tackle issues like shortage of space, real estate and maintenance costs, thereby enabling the customers to go through all available models effortlessly.\nIn fact, companies like Hyundai are minimizing the number of sales executives because they are bringing the cars to the customers and not the other way around. By tweaking around with the applications of AR, they are enabling the potential buyers to virtual test-drives and the option to breeze through all available variants at home, in real time.\nThe car has been sold, and now you will remember what I said at the beginning of this article and exclaim “Where in the world is Jarvis?”.\n\nI got you covered. Every Jarvis is incomplete without AR based ‘Heads-Up Displays’, lovingly known as ‘HUDs’. These HUDs will transform automobile windscreens into large computer screens, non-intrusively displaying travel information—navigation directions, vehicle speed, weather information, live traffic data, and even collision warnings—directly superimposed in the driver’s line of vision.\n\nNow, you can get the experience of being a fighter-jet pilot, with all the HUDs and other jargonish equipment, in fact, if you were on a long drive with your closest pals, you may communicate with them in military slang. Just don’t try the above with others, you’ll be deemed as a strange freak who happens to be home-alone, or drive-alone.\n\nReaders who are inquisitive enough may have questioned the last line above. Communicating with strangers. \nAs out of the world that sounds, this factor holds the potential to reduce incidents of road-rage by an enormous amount! Consider this for a moment, you are rushing to the airport as you’ve been running late, and have no choice other than to cut people off in the drive-way to reach there in time. But this unsurprisingly will annoy other drivers and trigger them to confront you. But you have a vehicle which has the ability to transmit messages such as “Late to the airport, please give way”, which will pop up on their screens, informing them to keep an eye out. AR saves the day, yet again.\nAR in automobiles could reach mainstream relevance with most consumers before AR headsets or smart-glasses. With cars, there's no cumbersome, head worn display to act as a hurdle to adoption, as content is projected directly onto windshields or dashboard-mounted displays and the issue of roaming around with a headset heavier than your dog is eliminated. Miniaturization of computing hardware is also not as big a concern with AR in cars as compared to the challenges of embedding the same technology in a pair of smart-glasses.\nBut don’t head out the door already with the claim that you own 10% of the factory of that friend of yours. Remember that AR is still at a very nascent stage in the development cycle. But the future implications of this technology happen to be literally endless and equivalently revolutionary. \nJust try to imagine the ease of business, and a general sense of well-being AR will induce in the coming generations. I will leave it to you and your imagination to give you the chills, which you will surely get, once you let this concept germinate in your head."
  },
  {
    "author":"Preet Ganatra",
    "date": "Mon, Mar 15",
    "readtime":"5 min read",
    "img": "https://images.unsplash.com/photo-1477477384939-312ffc1177bf?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8ZnVlbHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=800&q=60",
    "heading": "Oh! ‘Dear’ Fuel...",
    "news": "“Petrol! Petrol!” resonated in all pockets of the city, as petrol scores a century!\n\nOn 17th February, 2021, retail petrol prices crossed the psychological three-figure mark of ₹100 in Sri Ganganagar, Rajasthan and subsequently in Mumbai. Prices have been above ₹90 per litre in most other cities as well. Concurrently, retail prices of diesel have also inched towards all-time-highs of above ₹85. High fuel prices have remained unchanged for 15 consecutive days and customers are paying through their nose, having little hopes for any price-cuts. The issue is acutely turning into a game of political football, thereby triggering unending debates and bickering. Here are all the causes, facts and figures you must know to clearly understand the problem.\n\n\nOverview\nCrude oil (also known as ‘black gold’), originally discovered during the industrial revolution, has over time become the single most important source of energy and a crucial component of our daily lives. India is ranked as the third-largest primary energy consumer in the world, after the USA and China, with the petroleum products’ consumption volume being approximately 211.03 million metric tonnes in the fiscal year 2019 (as per the Ministry of Petroleum and Natural Gas). Since inland production cannot suffice this massive demand, more than 80% of the consumption is met via imports. Consequently, any fluctuation in the global Brent crude prices has a direct and sizable impact on the oil prices in the country. Our top crude oil suppliers include Saudi Arabia and Iraq.\n\nUnderstanding the International Factors\nLike any other commodity, the prices of crude oil are determined by the supply and demand dynamics. Last year, the demand for crude oil saw a steep fall due to the COVID-19 pandemic. In April 2020, crude oil prices collapsed to about $20 per barrel, forcing most of the oil-supplying states to cut down their production. As the economies opened up, prices got restored to $40 per barrel and remained steady for five months until the end of October.\n\nHowever, as the vaccine is rolled out and the demand is expected to improve, the price of Brent crude increased by more than 50% in February 2021 and crossed the $60 per barrel mark. Meanwhile, Saudi Arabia, a major oil-supplier, has announced a production cut to the tune of 1 million barrels per day across February and March to boost oil prices.\n\nTheoretically, the petroleum and natural gas minister Mr Dharmendra Pradhan correctly justified the price hike through the above-mentioned international factors. But here’s the catch.\n\nThe base price of Brent crude oil makes up less than 30% of the total fuel price, implying that only 30% of the fuel prices are benchmarked to international rates. \n\nThe imported crude oil needs to be refined into more useful forms like petroleum naphtha, gasoline, diesel fuel, kerosene, liquefied petroleum gas, jet fuel and fuel oils. This is done by dealers like BPCL, HPCL, etc. Additionally, the Centre and State governments charge taxes in the form of excise duty, VAT and cess. The excise duty is fixed and collected by the Centre whereas the VAT is collected by state governments and it differs from state to state. Finally, there is the dealers’ commission. This is a mere amount of ₹1-3 per litre, which is paid to the petrol pump owners. Therefore, there’s no hiding that the taxes claim a lion’s share in the retail price of fuels.\n\nThe Tax Twist\nHistorically, petroleum prices were subsidised in India between 1947 and 2010, to protect the end-users from international price fluctuations. This implies that end-users never saw a shocking jump in the prices, even when international prices were sky-high. These built-up heavy losses in the books of the government and oil companies. Consequently, from June 2010 petrol prices were deregulated from government control, followed by diesel price deregulation in June 2014. Thereon, fuel prices are daily determined by the oil companies based on international oil prices, plus taxes and dealer commission.\n\nBefore the pandemic, in early 2020, the excise duty collected on petrol stood at ₹19.98 per litre, whereas on diesel it was ₹15.83 per litre. With the dwindling demand during the pandemic, the steady revenue of the government dipped substantially. As a counter-measure, the excise duty on petrol and diesel was hiked by ₹13 and ₹16 per litre respectively. Similarly, when the international Brent crude oil prices hit a two-decade low in April 2020, the state government too hiked their taxes. Now, even after the crude oil prices have been restored to normal, the taxes remain unchanged.\n\nUnderstanding the plight of states\nBy rule, the Centre has to share close to 41% of their excise collection with the states. One would logically question the states to cut down the VAT. But, there’s a catch.\n\nExcise duty is made up of three different components - basic excise duty, special additional excise duty and ‘road and infrastructure cess’. Among these, the Centre does not have to share the cess with the states. Thus, to maximise their revenue, the centre collects a larger portion (close to 90%) of their excise duty in the form of cess. This leaves the states with a very small portion, therefore compelling them to impose a higher VAT along with ‘disaster management cess’ and ‘highway liquor ban cess’. Currently, Maharashtra and Rajasthan are among the few states imposing the highest tax on fuel.\n\nA peek into the past\n\nCuriously, a similar hike in Brent Crude Oil was seen in May 2014, when the prices shot up close to $106 per barrel. Despite the high base price, the end customer had to pay only close to ₹70-75 per litre. This is because the taxes then were adjusted to ensure that the customers have to pay a fair price. However, many believe that it is unfair to compare these two time periods because fuels were only partially deregulated in 2014.\n\n\nSource: India Today Group\n\nThe hike in fuel prices not only implies higher personal transportation cost but also has sparked inflationary trends in the prices of essential goods and services. Sales in the automobile sector, though not affected in the short term, are expected to decline if the fuel prices continue to remain high. A restraining trend is already noticed among the price-sensitive two-wheeler buyers. However, given the international supply-cuts, relief to the end-customers is uncertain and far-fetched.\n\nOn a positive note:\n\nIn June last year, the oil ministry tweeted: “Taking advantage of low crude prices due to the COVID-19 situation, India filled its strategic reserves to full capacity,\" adding that this lead to a forex saving of ₹5000 crores. These reserves act as insurance against price fluctuations. Therefore, we can only hope that if the international crude oil prices are to shoot up again, petrol and diesel prices do not increase further.\n\nAlso, India is staunchly transitioning from being an ‘oil economy’ to becoming a ‘gas economy’, intending to cut down on imports and become more self-reliant. As part of the energy mix, India is planning to multiply its natural gas consumption from the current level of 6.2% to 15% by 2030. It is currently working towards expanding the Piped Natural Gas (PNG) and Compressed Natural Gas (CNG) facilities across the country since it is a cheaper alternative to petrol and diesel.\n\n\nLastly, high prices discourage people from becoming too wasteful in consuming these fuels. This is a common practice in Scandanavian countries, where fuel is kept expensive throughout, to remain more energy-efficient and less polluted.\n\n\nOn that account, if India is to become greener, this might just be worth it. Otherwise, inflation is all set to brew up!"
  }  
]
